C:\Users\Administrator\Desktop\bin>antihook EnumNdisMiniporList
Number:2

Index:1
Offset:000 Length:004 Name:Header
        Type:17
        Revision:1
        Size:6216
Offset:008 Length:008 Name:NextMiniport                              俺不关心这个，暂不处理
Offset:010 Length:008 Name:BaseMiniport                              俺不关心这个，暂不处理
Offset:018 Length:008 Name:MiniportAdapterContext                    Value:FFFF8406BF33B010
Offset:020 Length:001 Name:MajorNdisVersion                          俺不关心这个，暂不处理
Offset:021 Length:001 Name:MinorNdisVersion                          俺不关心这个，暂不处理
Offset:028 Length:008 Name:PcwDataBlock                              俺不关心这个，暂不处理
Offset:030 Length:004 Name:PcwDatapathEventMask                      俺不关心这个，暂不处理
Offset:030 Length:008 Name:Reserved28                                俺不关心这个，暂不处理
Offset:038 Length:008 Name:OpenQueue                                 俺不关心这个，暂不处理
Offset:050 Length:004 Name:PcwDatapathCycleMask                      俺不关心这个，暂不处理
Offset:050 Length:008 Name:Reserved29                                俺不关心这个，暂不处理
Offset:058 Length:001 Name:LinkStateIndicationFlags                  俺不关心这个，暂不处理
Offset:059 Length:001 Name:LockAcquired                              俺不关心这个，暂不处理
Offset:05a Length:001 Name:PmodeOpens                                俺不关心这个，暂不处理
Offset:05b Length:001 Name:LoopbackOpens                             俺不关心这个，暂不处理
Offset:060 Length:008 Name:Lock                                      俺不关心这个，暂不处理

Offset:1310 Length:004 Name:VfSerialNumber                            俺不关心这个，暂不处理
Offset:1320 Length:008 Name:RefCountTracker                           俺不关心这个，暂不处理
Offset:1328 Length:008 Name:NsiRefCountTracker                        俺不关心这个，暂不处理
Offset:1330 Length:008 Name:QosHwCapabilities                         俺不关心这个，暂不处理
Offset:1338 Length:008 Name:QosCurrentCapabilities                    俺不关心这个，暂不处理
Offset:1340 Length:008 Name:QosOperationalParameters                  俺不关心这个，暂不处理
Offset:1348 Length:004 Name:QosOperationalParametersBufferSize        俺不关心这个，暂不处理
Offset:1350 Length:008 Name:QosRemoteParameters                       俺不关心这个，暂不处理
Offset:1358 Length:004 Name:QosRemoteParametersBufferSize             俺不关心这个，暂不处理
Offset:1360 Length:008 Name:DeviceFlags                               俺不关心这个，暂不处理
Offset:1368 Length:008 Name:VerifierContext                           Value:0000000000000000
Offset:14a0 Length:001 Name:PmInterruptedByPnp                        俺不关心这个，暂不处理
Offset:14a1 Length:001 Name:DoNotBlockOnMiniportLock                  俺不关心这个，暂不处理
Offset:14a2 Length:001 Name:PoFxDStateReportingEnabled                俺不关心这个，暂不处理
Offset:14a8 Length:008 Name:HookAdapterHandle                         俺不关心这个，暂不处理
Offset:14d0 Length:001 Name:InterfaceUpdateInProgress                 俺不关心这个，暂不处理
Offset:14d1 Length:001 Name:MacAddressUpdateQueued                    俺不关心这个，暂不处理
Offset:14d2 Length:001 Name:MtuUpdateQueued                           俺不关心这个，暂不处理
Offset:14f8 Length:004 Name:PendingMtuSize                            俺不关心这个，暂不处理
Offset:1500 Length:008 Name:PnPInstanceId                             俺不关心这个，暂不处理
Offset:1570 Length:008 Name:PDBlock                                   俺不关心这个，暂不处理
Offset:1578 Length:008 Name:PdcHandle                                 Value:0000000000000000
Offset:1650 Length:004 Name:PdcTaskClientMode                         俺不关心这个，暂不处理
Offset:1654 Length:004 Name:ModernStandbyWoLMagicPacketEnable         俺不关心这个，暂不处理
Offset:1658 Length:008 Name:RssV2Context                              俺不关心这个，暂不处理
Offset:1660 Length:004 Name:RssV2CompletionCount                      俺不关心这个，暂不处理
Offset:1680 Length:001 Name:RssV2Initialized                          俺不关心这个，暂不处理
Offset:1698 Length:008 Name:HwTimestampCapabilities                   俺不关心这个，暂不处理
Offset:16a0 Length:008 Name:HwTimestampCurrentConfig                  俺不关心这个，暂不处理
Offset:16a8 Length:008 Name:TopTimestampConfig                        俺不关心这个，暂不处理
Offset:16b0 Length:008 Name:TopHwTimestampCapabilities                俺不关心这个，暂不处理
Offset:17d0 Length:001 Name:HasConversionFilter                       俺不关心这个，暂不处理

---------------------------------------------------------------------------------------


C:\Users\Administrator\Desktop\bin>


上面是程序输出
下面是验证输出


0: kd> .for (r $t0 = poi(ndis!ndisMiniportList); @$t0 != 0; r $t0 = poi(@$t0 + @@(#FIELD_OFFSET(ndis!_NDIS_MINIPORT_BLOCK, NextGlobalMiniport)))) { dt ndis!_NDIS_MINIPORT_BLOCK @$t0 }
   +0x000 Header           : _NDIS_OBJECT_HEADER
   +0x008 NextMiniport     : 0xffff8406`be70b1a0 _NDIS_MINIPORT_BLOCK
   +0x010 BaseMiniport     : 0xffff8406`be70d1a0 _NDIS_MINIPORT_BLOCK
   +0x018 MiniportAdapterContext : 0xffff8406`bf33b010 Void
   +0x020 Reserved4        : _UNICODE_STRING ""
   +0x020 MajorNdisVersion : 0x6 ''
   +0x021 MinorNdisVersion : 0x46 'F'
   +0x028 PcwDataBlock     : (null) 
   +0x030 PcwDatapathEventMask : 0n0
   +0x030 Reserved28       : (null) 
   +0x038 OpenQueue        : 0xffff8406`c0edf010 _NDIS_OPEN_BLOCK
   +0x040 ShortRef         : _REFERENCE
   +0x050 PcwDatapathCycleMask : 0n0
   +0x050 Reserved29       : (null) 
   +0x058 LinkStateIndicationFlags : 0x1f ''
   +0x059 LockAcquired     : 0 ''
   +0x05a PmodeOpens       : 0 ''
   +0x05b LoopbackOpens    : 0 ''
   +0x060 Lock             : 0
   +0x068 Reserved25       : (null) 
   +0x070 Interrupt        : (null) 
   +0x078 Flags            : 0xc450000
   +0x07c PnPFlags         : 0x210000
   +0x080 PacketList       : _LIST_ENTRY [ 0xffff8406`be70d220 - 0xffff8406`be70d220 ]
   +0x090 FirstPendingPacket : (null) 
   +0x098 ReturnPacketsQueue : (null) 
   +0x0a0 RequestBuffer    : 0xb
   +0x0a8 Reserved26       : (null) 
   +0x0b0 PrimaryMiniport  : 0xffff8406`be70d1a0 _NDIS_MINIPORT_BLOCK
   +0x0b8 NextCancelSendNetBufferListsHandler : 0xfffff806`240ec860     void  NDIS!ndis6DummyReceiveComplete+0
   +0x0c0 OidContext       : (null) 
   +0x0c8 SupportedOidListLength : 0x124
   +0x0d0 Resources        : (null) 
   +0x0d8 WakeUpDpcTimer   : _NDIS_TIMER
   +0x158 Reserved20       : _UNICODE_STRING ""
   +0x158 MiniportMediaConnectState : 2 ( MediaConnectStateDisconnected )
   +0x15c MiniportMediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x168 SymbolicLinkName : _UNICODE_STRING "\??\VMBUS#{f8615163-df3e-46c5-913f-f2d2f965ed0e}#{49cfbf60-3ca5-4c96-912f-02b35dfe67db}#{ad498944-762f-11d0-8dcb-00c04fc3358c}\{AAF79E81-F0B3-424D-8974-27FCEB50ADF5}"
   +0x178 CheckForHangSeconds : 4
   +0x17c CFHangTicks      : 0
   +0x17e CFHangCurrentTick : 0
   +0x180 ResetStatus      : 0n0
   +0x188 ResetOpen        : (null) 
   +0x190 EthDB            : 0xffff8406`be731650 _X_FILTER
   +0x190 NullDB           : 0xffff8406`be731650 _X_FILTER
   +0x198 Unused1          : (null) 
   +0x1a0 Unused2          : (null) 
   +0x1a8 Unused3          : (null) 
   +0x1b0 PacketIndicateHandler : 0xfffff806`24108bb0     void  NDIS!ndisMDummyIndicatePacket+0
   +0x1b8 SendCompleteHandler : 0xfffff806`24092ea0     void  NDIS!ndisMSendCompleteX+0
   +0x1c0 SendResourcesHandler : 0xfffff806`2412eda0     void  NDIS!NdisMSendResourcesAvailable+0
   +0x1c8 ResetCompleteHandler : 0xfffff806`240f7ef0     void  NDIS!NdisMResetComplete+0
   +0x1d0 MediaType        : 0 ( NdisMedium802_3 )
   +0x1d4 AutoNegotiationFlags : 0
   +0x1d8 Reserved5        : 0 ( NdisInterfaceInternal )
   +0x1dc AdapterType      : 0 ( NdisInterfaceInternal )
   +0x1e0 Reserved6        : 0x00000000`00000002 _DEVICE_OBJECT
   +0x1e0 MediaConnectState : 2 ( MediaConnectStateDisconnected )
   +0x1e8 Reserved7        : (null) 
   +0x1e8 MediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x1f0 SupportedOidList : 0xffff8406`bf2d2400  -> 0x20101
   +0x1f8 MiniportSGDmaBlock : (null) 
   +0x200 CallMgrAfList    : (null) 
   +0x208 MiniportThread   : (null) 
   +0x210 SetInfoBuf       : (null) 
   +0x218 SetInfoBufLen    : 0
   +0x21a MaxSendPackets   : 0
   +0x21c FakeStatus       : 0n-1071448033
   +0x220 Reserved24       : 0xfffff806`24173cb0 Void
   +0x220 GlobalTriageBlock : 0xfffff806`24173cb0 Void
   +0x228 CombinedNdisRSSParameters : (null) 
   +0x230 TimerQueue       : (null) 
   +0x230 TimerObjectQueue : (null) 
   +0x238 MacOptions       : 0x2cd
   +0x240 PendingRequest   : (null) 
   +0x248 MaximumLongAddresses : 0x40
   +0x24c Reserved27       : 0
   +0x250 MiniportCurrentLookahead : 0
   +0x254 MiniportMaximumLookahead : 0x200
   +0x258 Reserved1        : 0
   +0x258 NullMediaFilter  : (null) 
   +0x260 DisableInterruptHandler : (null) 
   +0x268 EnableInterruptHandler : (null) 
   +0x270 SendPacketsHandler : (null) 
   +0x278 DeferredSendHandler : (null) 
   +0x280 EthRxIndicateHandler : 0xfffff806`240f0310     void  NDIS!EthFilterDprIndicateReceive+0
   +0x288 Reserved30       : (null) 
   +0x290 NextSendNetBufferListsHandler : 0xfffff806`24093d10     void  NDIS!ndisMFakeSendNetBufferLists+0
   +0x298 EthRxCompleteHandler : 0xfffff806`240928d0     void  NDIS!EthFilterDprIndicateReceiveComplete+0
   +0x2a0 Reserved31       : (null) 
   +0x2a8 SavedNextSendNetBufferListsHandler : 0xfffff806`24068760     void  NDIS!ndisSendNBLToFilter+0
   +0x2b0 StatusHandler    : 0xfffff806`240e98e0     void  NDIS!NdisMIndicateStatus+0
   +0x2b8 StatusCompleteHandler : 0xfffff806`240ec860     void  NDIS!ndis6DummyReceiveComplete+0
   +0x2c0 TDCompleteHandler : 0xfffff806`2412f090     void  NDIS!NdisMTransferDataComplete+0
   +0x2c8 QueryCompleteHandler : 0xfffff806`240c8910     void  NDIS!NdisMQueryInformationComplete+0
   +0x2d0 SetCompleteHandler : 0xfffff806`24118050     void  NDIS!NdisMSetInformationComplete+0
   +0x2d8 WanSendCompleteHandler : 0xfffff806`240d9940     void  NDIS!ndisMWanSendCompleteInternal+0
   +0x2e0 WanRcvHandler    : 0xfffff806`240f82e0     void  NDIS!NdisMWanIndicateReceive+0
   +0x2e8 WanRcvCompleteHandler : 0xfffff806`240f83a0     void  NDIS!NdisMWanIndicateReceiveComplete+0
   +0x2f0 SendNetBufferListsCompleteHandler : 0xfffff806`240727b0     void  NDIS!NdisMSendNetBufferListsComplete+0
   +0x2f8 PnPEventLockEvent : (null) 
   +0x300 MediaSpecificAttributes : (null) 
   +0x308 PendingQueryPowerIrp : (null) 
   +0x310 InterruptEx      : (null) 
   +0x318 XmitLinkSpeed    : 0x00000002`540be400
   +0x320 RcvLinkSpeed     : 0x00000002`540be400
   +0x328 PauseFunctions   : 0 ( NdisPauseFunctionsUnsupported )
   +0x32c MiniportPauseFunctions : 0 ( NdisPauseFunctionsUnsupported )
   +0x330 MiniportAutoNegotiationFlags : 0
   +0x338 WorkQueue        : [7] _SINGLE_LIST_ENTRY
   +0x370 SingleWorkItems  : [6] _SINGLE_LIST_ENTRY
   +0x3a0 SendFlags        : 0x2 ''
   +0x3a1 MP6SupportPM     : 0 ''
   +0x3a2 XState           : 0x2 ''
   +0x3a8 Log              : (null) 
   +0x3b0 AllocatedResources : (null) 
   +0x3b8 AllocatedResourcesTranslated : (null) 
   +0x3c0 PatternList      : _SINGLE_LIST_ENTRY
   +0x3c8 WOLPatternList   : _SINGLE_LIST_ENTRY
   +0x3d0 PMProtocolOffloadList : _SINGLE_LIST_ENTRY
   +0x3d8 PMCapabilities61 : _NDIS_PNP_CAPABILITIES
   +0x3e8 PMHardwareCapabilities : _NDIS_PM_CAPABILITIES
   +0x424 PMAdvertisedCapabilities : _NDIS_PM_CAPABILITIES
   +0x460 PMCurrentParameters : _NDIS_PM_PARAMETERS
   +0x474 PMWmiParameters  : _NDIS_PM_PARAMETERS
   +0x488 OriginalDeviceCaps : _DEVICE_CAPABILITIES
   +0x4c8 DeviceCaps       : _DEVICE_CAPABILITIES
   +0x508 S0WakeupSupported : 0 ''
   +0x50c WakeUpEnable     : 0
   +0x510 WaitWakeIrp      : (null) 
   +0x518 WaitWakeIrpCompleted : _KEVENT
   +0x530 WaitWakeIoCompletionRoutineRan : 0
   +0x531 WaitWakeCancelInProgress : 0
   +0x532 WaitWakeCancelAttempted : 0
   +0x534 WaitWakeSystemState : 0 ( PowerSystemUnspecified )
   +0x538 VcIndex          : _LARGE_INTEGER 0x0
   +0x540 VcCountLock      : 0
   +0x548 WmiEnabledVcs    : _LIST_ENTRY [ 0xffff8406`be70d6e8 - 0xffff8406`be70d6e8 ]
   +0x558 pNdisGuidMap     : 0xffff8406`bfd5a010 _NDIS_GUID
   +0x560 pCustomGuidMap   : 0xffff8406`bfd5ae48 _NDIS_GUID
   +0x568 VcCount          : 0
   +0x56a cNdisGuidMap     : 0x83
   +0x56c cCustomGuidMap   : 1
   +0x570 MediaDisconnectTimer : _NDIS_TIMER
   +0x5f0 PnPDeviceState   : 1 ( NdisPnPDeviceStarted )
   +0x5f4 OldPnPDeviceState : 0 ( NdisPnPDeviceAdded )
   +0x5f8 DeferredDpc      : _KDPC
   +0x638 StartTicks       : _LARGE_INTEGER 0xf8
   +0x640 IndicatedPacket  : 0xffff8406`be70e9d8  -> (null) 
   +0x648 RemoveReadyEvent : (null) 
   +0x650 AllRequestsCompletedEvent : (null) 
   +0x658 InitTimeMs       : 0x93
   +0x660 WorkItemBuffer   : [6] _NDIS_MINIPORT_WORK_ITEM
   +0x6f0 OidList          : 0xffff8406`be6ad010 _OID_LIST
   +0x6f8 InternalResetCount : 0
   +0x6fa MiniportResetCount : 0
   +0x6fc MediaSenseConnectCount : 0
   +0x6fe MediaSenseDisconnectCount : 9
   +0x700 xPackets         : (null) 
   +0x708 UserModeOpenReferences : 0
   +0x710 WSendPacketsHandler : (null) 
   +0x718 MiniportAttributes : 0x3a0
   +0x71c NumOpens         : 5
   +0x71e CFHangXTicks     : 0
   +0x720 RequestCount     : 0
   +0x724 IndicatedPacketsCount : 0
   +0x728 PhysicalMediumType : 0 ( NdisPhysicalMediumUnspecified )
   +0x72c MiniportMediaType : 0 ( NdisMedium802_3 )
   +0x730 DataLinkLayerType : 0 ( NdisMedium802_3 )
   +0x734 MpSpecifiedMediaType : 0 ( NdisMedium802_3 )
   +0x738 LastRequest      : (null) 
   +0x740 FakeMac          : (null) 
   +0x748 LockThread       : (null) 
   +0x750 InfoFlags        : 0x2130a00
   +0x758 TimerQueueLock   : 0
   +0x760 ResetCompletedEvent : (null) 
   +0x768 SavedPacketIndicateHandler : 0xfffff806`24094370     void  NDIS!ethFilterDprIndicateReceivePacket+0
   +0x770 RegisteredInterrupts : 0n0
   +0x774 SetOid           : 0
   +0x778 CFHCompletedEvent : _KEVENT
   +0x790 CFHWorkItem      : _WORK_QUEUE_ITEM
   +0x7b0 CFHWorkItemQueued : 0n0
   +0x7b8 DeviceContext    : (null) 
   +0x7c0 RssParametersBuffer : (null) 
   +0x7c8 UsingMSIX        : 0 ''
   +0x7c9 Miniport5InNdis6Mode : 0 ''
   +0x7ca Miniport5HasNdis6Component : 0x1 ''
   +0x7cb InitMode         : 0 ''
   +0x7cc InitModeNotNeededAnymore : 0x1 ''
   +0x7cd MediaChangeFilters : 0 ''
   +0x7ce CheckPacketFilters : 0x1 ''
   +0x7cf ReceiveFilters   : 0x1 ''
   +0x7d0 RecvLock         : 0
   +0x7d8 RecvState        : 6 ( NdisMiniportPaused )
   +0x7dc OutstandingReceives : 0
   +0x7e0 MiniportRecvLockThread : (null) 
   +0x7e8 NextSendPacketsHandler : 0xfffff806`24098220     void  NDIS!ndisMSendPacketsToNetBufferLists+0
   +0x7f0 FinalSendPacketsHandler : 0xfffff806`24098220     void  NDIS!ndisMSendPacketsToNetBufferLists+0
   +0x7f8 LowestFilter     : 0xffff8406`bfda55e0 _NDIS_FILTER_BLOCK
   +0x800 HighestFilter    : 0xffff8406`bf39e620 _NDIS_FILTER_BLOCK
   +0x808 ShutdownContext  : (null) 
   +0x810 ShutdownHandler  : (null) 
   +0x818 BugcheckCallbackRecord : _KBUGCHECK_CALLBACK_RECORD
   +0x858 TopIndicateNetBufferListsHandler : 0xfffff806`24074510     void  NDIS!ndisMDispatchReceiveNetBufferLists+0
   +0x860 TopIndicateLoopbackNetBufferListsHandler : 0xfffff806`24074510     void  NDIS!ndisMDispatchReceiveNetBufferLists+0
   +0x868 Ndis5PacketIndicateHandler : 0xfffff806`24094370     void  NDIS!ethFilterDprIndicateReceivePacket+0
   +0x870 MiniportReturnPacketHandler : (null) 
   +0x878 MiniportReturnPacketContext : (null) 
   +0x880 SynchronousReturnPacketHandler : 0xfffff806`240cad70     void  NDIS!ndisSynchReturnPacketsForTranslation+0
   +0x888 SynchronousReturnPacketContext : 0xffff8406`be70d1a0 Void
   +0x890 OidRequestList   : _LIST_ENTRY [ 0xffff8406`be70da30 - 0xffff8406`be70da30 ]
   +0x8a0 PendingOidRequest : (null) 
   +0x8a8 ProcessedOidRequest : (null) 
   +0x8b0 HookedOidRequest : (null) 
   +0x8b8 NextCoOidRequestHandle : (null) 
   +0x8c0 Ndis6ProtocolsBound : 1
   +0x8c4 PmodeOpen6       : 0
   +0x8c8 State            : 4 ( NdisMiniportRunning )
   +0x8d0 AsyncOpCompletionEvent : (null) 
   +0x8d8 AsyncOpCompletionStatus : 0n0
   +0x8e0 MaxXmitLinkSpeed : 0x00000002`540be400
   +0x8e8 MaxRcvLinkSpeed  : 0x00000002`540be400
   +0x8f0 SupportedPacketFilters : 0x2f
   +0x8f8 NoFilter         : _NDIS_MINIPORT_HANDLERS
   +0x9b0 Next             : _NDIS_MINIPORT_HANDLERS
   +0xa68 ReceivePathEnabled : 0 ''
   +0xa69 NormalTopReceive : 0x1 ''
   +0xa6c SendPathType     : 3 ( NdisFakeSendPath )
   +0xa70 SavedSendPathType : 0 ( NdisFilterSendPath )
   +0xa74 SavedReceivePathEnabled : 0x1 ''
   +0xa78 TimestampFlags   : 0
   +0xa7c FilterPnPFlags   : 0
   +0xa80 SupportedStatistics : 0x7fffff
   +0xa84 RecvScaleCapabilities : _NDIS_RECEIVE_SCALE_CAPABILITIES
   +0xa98 GeneralAttributes : (null) 
   +0xaa0 PortList         : _LIST_ENTRY [ 0xffff8406`be70dc40 - 0xffff8406`be70dc40 ]
   +0xab0 AllocatedPortIndices : (null) 
   +0xab8 AllocatedPortIndicesLength : 0
   +0xabc NumberOfPorts    : 0
   +0xac0 NumberOfActivePorts : 0
   +0xac8 MiniportXmitLinkSpeed : 0x00000002`540be400
   +0xad0 MiniportRcvLinkSpeed : 0x00000002`540be400
   +0xad8 InitModeTimeoutTimer : _NDIS_TIMER
   +0xb58 InitModeTimeoutWorkItem : _NDIS_WORK_ITEM
   +0xba8 InitModeTimeoutTimerQueuedEvent : _KEVENT
   +0xbc0 DataBackFillSize : 0
   +0xbc4 ContextBackFillSize : 0
   +0xbc8 TopFilterRestartAttributes : _NDIS_RESTART_GENERAL_ATTRIBUTES
   +0xc20 TopRecvScaleCapabilities : _NDIS_RECEIVE_SCALE_CAPABILITIES
   +0xc34 NsiOpenReferences : 0
   +0xc38 ProcessingOpen   : (null) 
   +0xc40 NsiRequestsCompletedEvent : (null) 
   +0xc48 QueryPowerDeviceState : 0 ( PowerDeviceUnspecified )
   +0xc4c MinimumNdisMajorVersion : 0x6 ''
   +0xc4d MinimumNdisMinorVersion : 0x46 'F'
   +0xc50 BottomIfStats    : (null) 
   +0xc58 PeriodicReceiveQueue : _NDIS_M_PERIODIC_RECEIVES
   +0xce0 PeriodicReceivesNblCountIndex : 0xffffde81`0f934118 PNDIS_PER_PROCESSOR_SLOT__
   +0xce8 DefaultSendControlState : 2 ( NdisPortControlStateUncontrolled )
   +0xcec DefaultRcvControlState : 2 ( NdisPortControlStateUncontrolled )
   +0xcf0 DefaultSendAuthorizationState : 2 ( NdisPortUnauthorized )
   +0xcf4 DefaultRcvAuthorizationState : 2 ( NdisPortUnauthorized )
   +0xcf8 DefaultPortSendControlState : 2 ( NdisPortControlStateUncontrolled )
   +0xcfc DefaultPortRcvControlState : 2 ( NdisPortControlStateUncontrolled )
   +0xd00 DefaultPortSendAuthorizationState : 2 ( NdisPortUnauthorized )
   +0xd04 DefaultPortRcvAuthorizationState : 2 ( NdisPortUnauthorized )
   +0xd08 PciDeviceCustomProperties : _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES
   +0xd40 TopNdis5PacketIndicateHandler : 0xfffff806`24094370     void  NDIS!ethFilterDprIndicateReceivePacket+0
   +0xd48 ndisSupportedOidList : 0xffff8406`bf31ebe0  -> 0x10101
   +0xd50 ndisSupportedOidListLength : 0x160
   +0xd54 MsiIntCount      : 0
   +0xd58 MiniportDpcWorkItem : _WORK_QUEUE_ITEM
   +0xd78 InvalidFrames    : 0
   +0xd80 PagingPathCount  : 0n0
   +0xd88 ReceiveQueueList : _LIST_ENTRY [ 0xffff8406`be70df28 - 0xffff8406`be70df28 ]
   +0xd98 AllocatedQueueIndices : (null) 
   +0xda0 AllocatedQueueIndicesLength : 0
   +0xda4 NumReceiveQueues : 0
   +0xda8 ReceiveFilterList : _LIST_ENTRY [ 0xffff8406`be70df48 - 0xffff8406`be70df48 ]
   +0xdb8 AllocatedReceiveFilterIndices : (null) 
   +0xdc0 AllocatedReceiveFilterIndicesLength : 0
   +0xdc4 NumReceiveFilters : 0
   +0xdc8 EnabledReceiveFilterTypes : 0
   +0xdcc EnabledReceiveQueueTypes : 0
   +0xdd0 ReceiveFilterHwCapabilities : (null) 
   +0xdd8 ReceiveFilterCurrentCapabilities : (null) 
   +0xde0 TopReceiveFilterCurrentCapabilities : (null) 
   +0xde8 NicSwitchHwCapabilities : (null) 
   +0xdf0 NicSwitchCurrentCapabilities : (null) 
   +0xdf8 TopNicSwitchCurrentCapabilities : (null) 
   +0xe00 SharedMemoryBlockList : _LIST_ENTRY [ 0xffff8406`be70dfa0 - 0xffff8406`be70dfa0 ]
   +0xe10 AllocateSharedMemoryHandler : (null) 
   +0xe18 FreeSharedMemoryHandler : (null) 
   +0xe20 AllocateSharedMemoryContext : (null) 
   +0xe28 MsiCaps          : PCI_MSI_CAPABILITY
   +0xe40 MsiXCaps         : PCI_MSIX_CAPABILITY
   +0xe50 NumberOfIndirectionTableChanges : 0
   +0xe58 PciDeviceSriovSupport : 0
   +0xe5c BeginSavedFields : 0 ''
   +0xe5c NumUserOpens     : 0
   +0xe60 OffloadRegistry  : _NDIS_MINIPORT_OFFLOAD_REG
   +0xe64 MediaDisconnectTimeOut : 0x14
   +0xe66 SGMapRegistersNeeded : 0x10
   +0xe68 DriverVerifyFlags : 0
   +0xe70 SetBusData       : (null) 
   +0xe78 GetBusData       : (null) 
   +0xe80 BusDataContext   : (null) 
   +0xe88 BusType          : f ( PNPBus )
   +0xe8c BusNumber        : 0
   +0xe90 OpenReadyEvent   : _NDIS_EVENT
   +0xea8 NumAdminOpens    : 0
   +0xeb0 DriverHandle     : 0xffff8406`be6ac940 _NDIS_M_DRIVER_BLOCK
   +0xeb8 BindPaths        : 0xffff8406`be51fbe0 _NDIS_BIND_PATHS
   +0xec0 MiniportPhysicalMediumType : 0 ( NdisPhysicalMediumUnspecified )
   +0xec8 SecurityDescriptor : 0xffff8406`be51f8c0 Void
   +0xed0 BaseName         : _UNICODE_STRING "{AAF79E81-F0B3-424D-8974-27FCEB50ADF5}"
   +0xee0 MiniportName     : _UNICODE_STRING "\DEVICE\{AAF79E81-F0B3-424D-8974-27FCEB50ADF5}"
   +0xef0 DeviceObject     : 0xffff8406`be70d050 _DEVICE_OBJECT
   +0xef8 PhysicalDeviceObject : 0xffff8406`bcfa17f0 _DEVICE_OBJECT
   +0xf00 NextDeviceObject : 0xffff8406`bcfa17f0 _DEVICE_OBJECT
   +0xf08 NextGlobalMiniport : 0xffff8406`be70b1a0 _NDIS_MINIPORT_BLOCK
   +0xf10 pAdapterInstanceName : 0xffff8406`be1c3f70 _UNICODE_STRING "Microsoft Hyper-V Network Adapter #3"
   +0xf18 PnPCapabilities  : 0x10000010
   +0xf1c CurrentDevicePowerState : 1 ( PowerDeviceD0 )
   +0xf20 PowerStateLock   : 0
   +0xf28 DriverPowerState : 1 ( PowerDeviceD0 )
   +0xf2c PrevDriverPowerState : 0 ( PowerDeviceUnspecified )
   +0xf30 LowPowerRcvReturnNbls : (null) 
   +0xf38 PendingReturnNBLCount : 0
   +0xf3c SurpriseRemoveFlushedRcvReturnQueue : 0 ''
   +0xf40 LowPowerRcvReturnNblTracker : (null) 
   +0xf48 PMAdminConfig    : _NDIS_PM_ADMIN_CONFIG
   +0xf50 PMPatternSemaphore : _KSEMAPHORE
   +0xf70 PMOffloadSemaphore : _KSEMAPHORE
   +0xf90 BusInterface     : (null) 
   +0xf98 InstanceNumber   : 2
   +0xfa0 ConfigurationHandle : 0xffff8406`be51e240 Void
   +0xfa8 InterfaceGuid    : _GUID {aaf79e81-f0b3-424d-8974-27fceb50adf5}
   +0xfb8 NetLuid          : _NET_LUID_LH
   +0xfc0 IfBlockAvailable : 0x1 ''
   +0xfc8 IfBlock          : 0xffff8406`be0db760 _NDIS_IF_BLOCK
   +0xfd0 IfBlockPointerRefZeroEvent : (null) 
   +0xfd8 IfIndex          : 0xd
   +0xfdc AdminStatus      : 1 ( NET_IF_ADMIN_STATUS_UP )
   +0xfe0 OperStatus       : 2 ( NET_IF_OPER_STATUS_DOWN )
   +0xfe4 OperStatusFlags  : 2
   +0xfe8 SendHandler      : (null) 
   +0xfe8 WanSendHandler   : (null) 
   +0xff0 NblTracker       : 0xffff8406`be7275d1 NDIS_NBL_TRACKER_HANDLE__
   +0xff8 ReenumerateSelfInterface : (null) 
   +0x1000 Offload          : 0xffff8406`bfda0920 _NDIS_MINIPORT_OFFLOAD
   +0x1008 NDKBlock         : (null) 
   +0x1010 AddDeviceContext : (null) 
   +0x1018 RemoveLock       : _IO_REMOVE_LOCK
   +0x1038 DevinterfaceNetSymbolicLinkName : _UNICODE_STRING "\??\VMBUS#{f8615163-df3e-46c5-913f-f2d2f965ed0e}#{49cfbf60-3ca5-4c96-912f-02b35dfe67db}#{cac88484-7515-4c03-82e6-71a87abac361}"
   +0x1048 PhysicalMediumInInf : 0
   +0x1050 ExportName       : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x1058 FilterClass      : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x1060 StatusProcessingThread : (null) 
   +0x1068 FdoName          : _UNICODE_STRING "\Device\NDMP2"
   +0x1078 PowerD0CompleteEvent : _KEVENT
   +0x1090 LastD0CompleteStatus : 0n0
   +0x1094 LastD0Reason     : 0 ( NdisMEvent_Unknown )
   +0x1098 DirectOidRequestCount : 0
   +0x10a0 AllDirectRequestsCompletedEvent : (null) 
   +0x10a8 HDSplitCurrentConfig : (null) 
   +0x10b0 MSIXConfigContext : (null) 
   +0x10b8 SetMSIXTableEntry : (null) 
   +0x10c0 MaskMSIXTableEntry : (null) 
   +0x10c8 UnmaskMSIXTableEntry : (null) 
   +0x10d0 DevicePowerStateWorkItem : _WORK_QUEUE_ITEM
   +0x10f0 SystemPowerStateWorkItem : _WORK_QUEUE_ITEM
   +0x1110 DefaultReceiveQueue : 0xffff8406`be6b93e0 _NDIS_RECEIVE_QUEUE_BLOCK
   +0x1118 MaxNumRssProcessors : 2
   +0x111c RssBaseProcessor : _PROCESSOR_NUMBER
   +0x1120 RssMaxProcessor  : _PROCESSOR_NUMBER
   +0x1124 RssProfile       : 4 ( NdisRssProfileNumaStatic )
   +0x1128 NumaNodeId       : 0
   +0x1130 NumaDistances    : 0xffff8406`be0e95b0  -> 0
   +0x1138 pModifiedInstanceName : (null) 
   +0x1140 SyncFlags        : 0
   +0x1144 WSyncFlags       : 0
   +0x1148 InterlockedFlags : 0
   +0x1150 Ref              : _ULONG_REFERENCE
   +0x1160 SelectiveSuspend : (null) 
   +0x1168 AoAc             : (null) 
   +0x1170 LastWakeReason   : 0 ( NdisWakeReasonUnspecified )
   +0x1178 PnpEventLog      : 0xffff8406`be1cc9d0 NDIS_EVENT_LOG_HANDLE__
   +0x1180 D0CompleteSignalWorkItem : _NDIS_D0_SIGNAL_WORK_ITEM
   +0x11d8 PhysicalPerformanceCounters : 0xffff8406`be535830 _NDIS_PHYSICAL_PERFORMANCE_COUNTERS
   +0x11e0 TimeOfInitialization : _LARGE_INTEGER 0x01dbcf73`c0ae5c18
   +0x11e8 LastSystemSleepTime : _LARGE_INTEGER 0x0
   +0x11f0 TotalSystemSleepTimeMs : 0
   +0x11f8 SriovHwCapabilities : (null) 
   +0x1200 SriovCurrentCapabilities : (null) 
   +0x1208 TopSriovCurrentCapabilities : (null) 
   +0x1210 InvalidateBlockMask : 0
   +0x1218 InvalidateBlockIoctlPf : (null) 
   +0x1220 InvalidateBlockIoctlVf : (null) 
   +0x1228 InvalidateBlockVfParams : _VPCI_INVALIDATE_BLOCK_OUTPUT
   +0x1230 InvalidateBlockEvent : _KEVENT
   +0x1248 InvalidateVfId   : 0
   +0x124a InvalidateBlockCancelling : 0 ''
   +0x124b AllowMultipleVPortsPerVF : 0 ''
   +0x1250 PFBlock          : (null) 
   +0x1258 NumSwitches      : 0
   +0x1260 NicSwitchList    : _LIST_ENTRY [ 0xffff8406`be70e400 - 0xffff8406`be70e400 ]
   +0x1270 NumAllocatedVFs  : 0
   +0x1278 VFList           : _LIST_ENTRY [ 0xffff8406`be70e418 - 0xffff8406`be70e418 ]
   +0x1288 NumActiveVPorts  : 0
   +0x1290 VPortList        : _LIST_ENTRY [ 0xffff8406`be70e430 - 0xffff8406`be70e430 ]
   +0x12a0 AllocatedVPortIndices : (null) 
   +0x12a8 AllocatedVPortIndicesLength : 0
   +0x12b0 SetVirtualFunctionData : (null) 
   +0x12b8 GetVirtualFunctionData : (null) 
   +0x12c0 EnableVirtualization : (null) 
   +0x12c8 GetVirtualDeviceLocation : (null) 
   +0x12d0 GetVirtualFunctionProbedBars : (null) 
   +0x12d8 VirtInterfaceContext : (null) 
   +0x12e0 DevinterfaceVirtSymbolicLinkName : _UNICODE_STRING ""
   +0x12f0 VpciInterfaceDereference : (null) 
   +0x12f8 WriteVfConfigBlock : (null) 
   +0x1300 ReadVfConfigBlock : (null) 
   +0x1308 VpciInterfaceContext : (null) 
   +0x1310 VfSerialNumber   : 0
   +0x1314 SriovLuid        : _LUID
   +0x1320 RefCountTracker  : 0xffff8406`be537840 NDIS_REFCOUNT_HANDLE__
   +0x1328 NsiRefCountTracker : 0xffff8406`be537420 NDIS_REFCOUNT_HANDLE__
   +0x1330 QosHwCapabilities : (null) 
   +0x1338 QosCurrentCapabilities : (null) 
   +0x1340 QosOperationalParameters : (null) 
   +0x1348 QosOperationalParametersBufferSize : 0
   +0x1350 QosRemoteParameters : (null) 
   +0x1358 QosRemoteParametersBufferSize : 0
   +0x1360 DeviceFlags      : 0
   +0x1368 VerifierContext  : (null) 
   +0x1370 SurpriseRemovalWorkItem : WORKITEM_WITH_IRP
   +0x1398 Bindings         : Ndis::BindStack
   +0x1400 BindEngine       : Ndis::BindEngine
   +0x1478 MiniportOwner    : Rtl::KNeutralLock<enum NDIS_MINIPORT_POLICY_OWNER>
   +0x14a0 PmInterruptedByPnp : 0
   +0x14a1 DoNotBlockOnMiniportLock : 0
   +0x14a2 PoFxDStateReportingEnabled : 0
   +0x14a8 HookAdapterHandle : (null) 
   +0x14b0 InterfaceUpdateWorkItem : _WORK_QUEUE_ITEM
   +0x14d0 InterfaceUpdateInProgress : 0
   +0x14d1 MacAddressUpdateQueued : 0
   +0x14d2 MtuUpdateQueued  : 0
   +0x14d4 PendingMacAddress : _IF_PHYSICAL_ADDRESS_LH
   +0x14f8 PendingMtuSize   : 0
   +0x1500 PnPInstanceId    : 0xffff8406`be663120  "VMBUS\{f8615163-df3e-46c5-913f-f2d2f965ed0e}\{49cfbf60-3ca5-4c96-912f-02b35dfe67db}"
   +0x1508 DevicePowerOnWorkItem : WORKITEM_WITH_IRP
   +0x1530 DevicePowerDownWorkItem : WORKITEM_WITH_IRP
   +0x1558 PendingOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x1560 HookedOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x1568 ReenumerateWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x1570 PDBlock          : 0xffff8406`be1c6200 _NDIS_PD_BLOCK
   +0x1578 PdcHandle        : (null) 
   +0x1580 PdcTaskClientDisableTimer : _NDIS_TIMER
   +0x1600 PdcTaskClientDisableWorkItem : _NDIS_WORK_ITEM
   +0x1650 PdcTaskClientMode : 0n0
   +0x1654 ModernStandbyWoLMagicPacketEnable : 0
   +0x1658 RssV2Context     : 0xffff8406`bf33a040 _NDIS_RSS_DPC_WORKER_CONTEXT
   +0x1660 RssV2CompletionCount : 0n0
   +0x1668 RssV2CompletionEvent : _KEVENT
   +0x1680 RssV2Initialized : 0 ''
   +0x1688 SynchronousOidCalls : _LIST_ENTRY [ 0xffff8406`be70e828 - 0xffff8406`be70e828 ]
   +0x1698 HwTimestampCapabilities : (null) 
   +0x16a0 HwTimestampCurrentConfig : (null) 
   +0x16a8 TopTimestampConfig : (null) 
   +0x16b0 TopHwTimestampCapabilities : (null) 
   +0x16b8 PktMonComp       : _PKTMON_COMPONENT_CONTEXT
   +0x16f8 PktMonEdge       : _PKTMON_EDGE_CONTEXT
   +0x1720 PollModeConfigKnobsNamespace : KnobNamespace
   +0x1768 PollModeConfigKnobDescriptors : Rtl::KArray<KnobDescriptor,1>
   +0x1778 PollModeConfigKnobs : _EXECUTION_CONTEXT_RUNTIME_KNOBS
   +0x17b4 PnPActivityID    : _GUID {bb38ed86-cf73-0001-d1ed-38bb73cfdb01}
   +0x17c8 IdleSm           : wistd::unique_ptr<NdisWdfIdle,KFreePoolNP<NdisWdfIdle> >
   +0x17d0 HasConversionFilter : 0
   +0x000 Header           : _NDIS_OBJECT_HEADER
   +0x008 NextMiniport     : (null) 
   +0x010 BaseMiniport     : 0xffff8406`be70b1a0 _NDIS_MINIPORT_BLOCK
   +0x018 MiniportAdapterContext : 0xffff8406`bf339010 Void
   +0x020 Reserved4        : _UNICODE_STRING ""
   +0x020 MajorNdisVersion : 0x6 ''
   +0x021 MinorNdisVersion : 0x46 'F'
   +0x028 PcwDataBlock     : (null) 
   +0x030 PcwDatapathEventMask : 0n0
   +0x030 Reserved28       : (null) 
   +0x038 OpenQueue        : 0xffff8406`c0f12030 _NDIS_OPEN_BLOCK
   +0x040 ShortRef         : _REFERENCE
   +0x050 PcwDatapathCycleMask : 0n0
   +0x050 Reserved29       : (null) 
   +0x058 LinkStateIndicationFlags : 0x1f ''
   +0x059 LockAcquired     : 0 ''
   +0x05a PmodeOpens       : 0 ''
   +0x05b LoopbackOpens    : 0 ''
   +0x060 Lock             : 0
   +0x068 Reserved25       : (null) 
   +0x070 Interrupt        : (null) 
   +0x078 Flags            : 0x2c450000
   +0x07c PnPFlags         : 0x210000
   +0x080 PacketList       : _LIST_ENTRY [ 0xffff8406`be70b220 - 0xffff8406`be70b220 ]
   +0x090 FirstPendingPacket : (null) 
   +0x098 ReturnPacketsQueue : (null) 
   +0x0a0 RequestBuffer    : 0xb
   +0x0a8 Reserved26       : (null) 
   +0x0b0 PrimaryMiniport  : 0xffff8406`be70b1a0 _NDIS_MINIPORT_BLOCK
   +0x0b8 NextCancelSendNetBufferListsHandler : 0xfffff806`2410f2b0     void  NDIS!ndisOpenCancelSendNetBufferLists+0
   +0x0c0 OidContext       : (null) 
   +0x0c8 SupportedOidListLength : 0x124
   +0x0d0 Resources        : (null) 
   +0x0d8 WakeUpDpcTimer   : _NDIS_TIMER
   +0x158 Reserved20       : _UNICODE_STRING ""
   +0x158 MiniportMediaConnectState : 1 ( MediaConnectStateConnected )
   +0x15c MiniportMediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x168 SymbolicLinkName : _UNICODE_STRING "\??\VMBUS#{f8615163-df3e-46c5-913f-f2d2f965ed0e}#{cb490da4-b548-49a5-b581-857663264247}#{ad498944-762f-11d0-8dcb-00c04fc3358c}\{EB5F55FA-BD2D-4AB8-ABD6-CBA5562ECDCD}"
   +0x178 CheckForHangSeconds : 4
   +0x17c CFHangTicks      : 0
   +0x17e CFHangCurrentTick : 0
   +0x180 ResetStatus      : 0n0
   +0x188 ResetOpen        : (null) 
   +0x190 EthDB            : 0xffff8406`be730210 _X_FILTER
   +0x190 NullDB           : 0xffff8406`be730210 _X_FILTER
   +0x198 Unused1          : (null) 
   +0x1a0 Unused2          : (null) 
   +0x1a8 Unused3          : (null) 
   +0x1b0 PacketIndicateHandler : 0xfffff806`24094370     void  NDIS!ethFilterDprIndicateReceivePacket+0
   +0x1b8 SendCompleteHandler : 0xfffff806`24092ea0     void  NDIS!ndisMSendCompleteX+0
   +0x1c0 SendResourcesHandler : 0xfffff806`2412eda0     void  NDIS!NdisMSendResourcesAvailable+0
   +0x1c8 ResetCompleteHandler : 0xfffff806`240f7ef0     void  NDIS!NdisMResetComplete+0
   +0x1d0 MediaType        : 0 ( NdisMedium802_3 )
   +0x1d4 AutoNegotiationFlags : 0
   +0x1d8 Reserved5        : 0 ( NdisInterfaceInternal )
   +0x1dc AdapterType      : 0 ( NdisInterfaceInternal )
   +0x1e0 Reserved6        : 0x00000000`00000001 _DEVICE_OBJECT
   +0x1e0 MediaConnectState : 1 ( MediaConnectStateConnected )
   +0x1e8 Reserved7        : (null) 
   +0x1e8 MediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x1f0 SupportedOidList : 0xffff8406`bf2d2b80  -> 0x20101
   +0x1f8 MiniportSGDmaBlock : (null) 
   +0x200 CallMgrAfList    : (null) 
   +0x208 MiniportThread   : (null) 
   +0x210 SetInfoBuf       : (null) 
   +0x218 SetInfoBufLen    : 0
   +0x21a MaxSendPackets   : 0
   +0x21c FakeStatus       : 0n0
   +0x220 Reserved24       : 0xfffff806`24173cb0 Void
   +0x220 GlobalTriageBlock : 0xfffff806`24173cb0 Void
   +0x228 CombinedNdisRSSParameters : 0xffff8406`bfd5c380 _NDIS_RECEIVE_SCALE_PARAMETERS
   +0x230 TimerQueue       : (null) 
   +0x230 TimerObjectQueue : (null) 
   +0x238 MacOptions       : 0x2cd
   +0x240 PendingRequest   : (null) 
   +0x248 MaximumLongAddresses : 0x40
   +0x24c Reserved27       : 0
   +0x250 MiniportCurrentLookahead : 0
   +0x254 MiniportMaximumLookahead : 0x200
   +0x258 Reserved1        : 0
   +0x258 NullMediaFilter  : (null) 
   +0x260 DisableInterruptHandler : (null) 
   +0x268 EnableInterruptHandler : (null) 
   +0x270 SendPacketsHandler : (null) 
   +0x278 DeferredSendHandler : (null) 
   +0x280 EthRxIndicateHandler : 0xfffff806`240f0310     void  NDIS!EthFilterDprIndicateReceive+0
   +0x288 Reserved30       : (null) 
   +0x290 NextSendNetBufferListsHandler : 0xfffff806`24068760     void  NDIS!ndisSendNBLToFilter+0
   +0x298 EthRxCompleteHandler : 0xfffff806`240928d0     void  NDIS!EthFilterDprIndicateReceiveComplete+0
   +0x2a0 Reserved31       : (null) 
   +0x2a8 SavedNextSendNetBufferListsHandler : 0xfffff806`24068760     void  NDIS!ndisSendNBLToFilter+0
   +0x2b0 StatusHandler    : 0xfffff806`240e98e0     void  NDIS!NdisMIndicateStatus+0
   +0x2b8 StatusCompleteHandler : 0xfffff806`240ec860     void  NDIS!ndis6DummyReceiveComplete+0
   +0x2c0 TDCompleteHandler : 0xfffff806`2412f090     void  NDIS!NdisMTransferDataComplete+0
   +0x2c8 QueryCompleteHandler : 0xfffff806`240c8910     void  NDIS!NdisMQueryInformationComplete+0
   +0x2d0 SetCompleteHandler : 0xfffff806`24118050     void  NDIS!NdisMSetInformationComplete+0
   +0x2d8 WanSendCompleteHandler : 0xfffff806`240d9940     void  NDIS!ndisMWanSendCompleteInternal+0
   +0x2e0 WanRcvHandler    : 0xfffff806`240f82e0     void  NDIS!NdisMWanIndicateReceive+0
   +0x2e8 WanRcvCompleteHandler : 0xfffff806`240f83a0     void  NDIS!NdisMWanIndicateReceiveComplete+0
   +0x2f0 SendNetBufferListsCompleteHandler : 0xfffff806`240727b0     void  NDIS!NdisMSendNetBufferListsComplete+0
   +0x2f8 PnPEventLockEvent : (null) 
   +0x300 MediaSpecificAttributes : (null) 
   +0x308 PendingQueryPowerIrp : (null) 
   +0x310 InterruptEx      : (null) 
   +0x318 XmitLinkSpeed    : 0x00000002`540be400
   +0x320 RcvLinkSpeed     : 0x00000002`540be400
   +0x328 PauseFunctions   : 0 ( NdisPauseFunctionsUnsupported )
   +0x32c MiniportPauseFunctions : 0 ( NdisPauseFunctionsUnsupported )
   +0x330 MiniportAutoNegotiationFlags : 0
   +0x338 WorkQueue        : [7] _SINGLE_LIST_ENTRY
   +0x370 SingleWorkItems  : [6] _SINGLE_LIST_ENTRY
   +0x3a0 SendFlags        : 0x2 ''
   +0x3a1 MP6SupportPM     : 0 ''
   +0x3a2 XState           : 0 ''
   +0x3a8 Log              : (null) 
   +0x3b0 AllocatedResources : (null) 
   +0x3b8 AllocatedResourcesTranslated : (null) 
   +0x3c0 PatternList      : _SINGLE_LIST_ENTRY
   +0x3c8 WOLPatternList   : _SINGLE_LIST_ENTRY
   +0x3d0 PMProtocolOffloadList : _SINGLE_LIST_ENTRY
   +0x3d8 PMCapabilities61 : _NDIS_PNP_CAPABILITIES
   +0x3e8 PMHardwareCapabilities : _NDIS_PM_CAPABILITIES
   +0x424 PMAdvertisedCapabilities : _NDIS_PM_CAPABILITIES
   +0x460 PMCurrentParameters : _NDIS_PM_PARAMETERS
   +0x474 PMWmiParameters  : _NDIS_PM_PARAMETERS
   +0x488 OriginalDeviceCaps : _DEVICE_CAPABILITIES
   +0x4c8 DeviceCaps       : _DEVICE_CAPABILITIES
   +0x508 S0WakeupSupported : 0 ''
   +0x50c WakeUpEnable     : 0
   +0x510 WaitWakeIrp      : (null) 
   +0x518 WaitWakeIrpCompleted : _KEVENT
   +0x530 WaitWakeIoCompletionRoutineRan : 0
   +0x531 WaitWakeCancelInProgress : 0
   +0x532 WaitWakeCancelAttempted : 0
   +0x534 WaitWakeSystemState : 0 ( PowerSystemUnspecified )
   +0x538 VcIndex          : _LARGE_INTEGER 0x0
   +0x540 VcCountLock      : 0
   +0x548 WmiEnabledVcs    : _LIST_ENTRY [ 0xffff8406`be70b6e8 - 0xffff8406`be70b6e8 ]
   +0x558 pNdisGuidMap     : 0xffff8406`bf39f010 _NDIS_GUID
   +0x560 pCustomGuidMap   : 0xffff8406`bf39fe48 _NDIS_GUID
   +0x568 VcCount          : 0
   +0x56a cNdisGuidMap     : 0x83
   +0x56c cCustomGuidMap   : 1
   +0x570 MediaDisconnectTimer : _NDIS_TIMER
   +0x5f0 PnPDeviceState   : 1 ( NdisPnPDeviceStarted )
   +0x5f4 OldPnPDeviceState : 0 ( NdisPnPDeviceAdded )
   +0x5f8 DeferredDpc      : _KDPC
   +0x638 StartTicks       : _LARGE_INTEGER 0xf8
   +0x640 IndicatedPacket  : 0xffff8406`be70c9d8  -> (null) 
   +0x648 RemoveReadyEvent : (null) 
   +0x650 AllRequestsCompletedEvent : (null) 
   +0x658 InitTimeMs       : 0x93
   +0x660 WorkItemBuffer   : [6] _NDIS_MINIPORT_WORK_ITEM
   +0x6f0 OidList          : 0xffff8406`be6af010 _OID_LIST
   +0x6f8 InternalResetCount : 0
   +0x6fa MiniportResetCount : 0
   +0x6fc MediaSenseConnectCount : 9
   +0x6fe MediaSenseDisconnectCount : 0
   +0x700 xPackets         : (null) 
   +0x708 UserModeOpenReferences : 0
   +0x710 WSendPacketsHandler : (null) 
   +0x718 MiniportAttributes : 0x3a0
   +0x71c NumOpens         : 5
   +0x71e CFHangXTicks     : 0
   +0x720 RequestCount     : 0
   +0x724 IndicatedPacketsCount : 0
   +0x728 PhysicalMediumType : 0 ( NdisPhysicalMediumUnspecified )
   +0x72c MiniportMediaType : 0 ( NdisMedium802_3 )
   +0x730 DataLinkLayerType : 0 ( NdisMedium802_3 )
   +0x734 MpSpecifiedMediaType : 0 ( NdisMedium802_3 )
   +0x738 LastRequest      : (null) 
   +0x740 FakeMac          : (null) 
   +0x748 LockThread       : (null) 
   +0x750 InfoFlags        : 0x2130a00
   +0x758 TimerQueueLock   : 0
   +0x760 ResetCompletedEvent : (null) 
   +0x768 SavedPacketIndicateHandler : 0xfffff806`24094370     void  NDIS!ethFilterDprIndicateReceivePacket+0
   +0x770 RegisteredInterrupts : 0n0
   +0x774 SetOid           : 0
   +0x778 CFHCompletedEvent : _KEVENT
   +0x790 CFHWorkItem      : _WORK_QUEUE_ITEM
   +0x7b0 CFHWorkItemQueued : 0n0
   +0x7b8 DeviceContext    : (null) 
   +0x7c0 RssParametersBuffer : 0xffff8406`bfd5c380 _NDIS_MINIPORT_RSS_PARAMETERS_CACHE
   +0x7c8 UsingMSIX        : 0 ''
   +0x7c9 Miniport5InNdis6Mode : 0 ''
   +0x7ca Miniport5HasNdis6Component : 0x1 ''
   +0x7cb InitMode         : 0 ''
   +0x7cc InitModeNotNeededAnymore : 0x1 ''
   +0x7cd MediaChangeFilters : 0 ''
   +0x7ce CheckPacketFilters : 0x1 ''
   +0x7cf ReceiveFilters   : 0x1 ''
   +0x7d0 RecvLock         : 0
   +0x7d8 RecvState        : 6 ( NdisMiniportPaused )
   +0x7dc OutstandingReceives : 0
   +0x7e0 MiniportRecvLockThread : (null) 
   +0x7e8 NextSendPacketsHandler : 0xfffff806`24098220     void  NDIS!ndisMSendPacketsToNetBufferLists+0
   +0x7f0 FinalSendPacketsHandler : 0xfffff806`24098220     void  NDIS!ndisMSendPacketsToNetBufferLists+0
   +0x7f8 LowestFilter     : 0xffff8406`bfda5010 _NDIS_FILTER_BLOCK
   +0x800 HighestFilter    : 0xffff8406`bf3989f0 _NDIS_FILTER_BLOCK
   +0x808 ShutdownContext  : (null) 
   +0x810 ShutdownHandler  : (null) 
   +0x818 BugcheckCallbackRecord : _KBUGCHECK_CALLBACK_RECORD
   +0x858 TopIndicateNetBufferListsHandler : 0xfffff806`24074510     void  NDIS!ndisMDispatchReceiveNetBufferLists+0
   +0x860 TopIndicateLoopbackNetBufferListsHandler : 0xfffff806`24074510     void  NDIS!ndisMDispatchReceiveNetBufferLists+0
   +0x868 Ndis5PacketIndicateHandler : 0xfffff806`24094370     void  NDIS!ethFilterDprIndicateReceivePacket+0
   +0x870 MiniportReturnPacketHandler : (null) 
   +0x878 MiniportReturnPacketContext : (null) 
   +0x880 SynchronousReturnPacketHandler : 0xfffff806`240cad70     void  NDIS!ndisSynchReturnPacketsForTranslation+0
   +0x888 SynchronousReturnPacketContext : 0xffff8406`be70b1a0 Void
   +0x890 OidRequestList   : _LIST_ENTRY [ 0xffff8406`be70ba30 - 0xffff8406`be70ba30 ]
   +0x8a0 PendingOidRequest : (null) 
   +0x8a8 ProcessedOidRequest : (null) 
   +0x8b0 HookedOidRequest : (null) 
   +0x8b8 NextCoOidRequestHandle : (null) 
   +0x8c0 Ndis6ProtocolsBound : 1
   +0x8c4 PmodeOpen6       : 0
   +0x8c8 State            : 4 ( NdisMiniportRunning )
   +0x8d0 AsyncOpCompletionEvent : (null) 
   +0x8d8 AsyncOpCompletionStatus : 0n0
   +0x8e0 MaxXmitLinkSpeed : 0x00000002`540be400
   +0x8e8 MaxRcvLinkSpeed  : 0x00000002`540be400
   +0x8f0 SupportedPacketFilters : 0x2f
   +0x8f8 NoFilter         : _NDIS_MINIPORT_HANDLERS
   +0x9b0 Next             : _NDIS_MINIPORT_HANDLERS
   +0xa68 ReceivePathEnabled : 0x1 ''
   +0xa69 NormalTopReceive : 0x1 ''
   +0xa6c SendPathType     : 0 ( NdisFilterSendPath )
   +0xa70 SavedSendPathType : 0 ( NdisFilterSendPath )
   +0xa74 SavedReceivePathEnabled : 0x1 ''
   +0xa78 TimestampFlags   : 0
   +0xa7c FilterPnPFlags   : 0
   +0xa80 SupportedStatistics : 0x7fffff
   +0xa84 RecvScaleCapabilities : _NDIS_RECEIVE_SCALE_CAPABILITIES
   +0xa98 GeneralAttributes : (null) 
   +0xaa0 PortList         : _LIST_ENTRY [ 0xffff8406`be70bc40 - 0xffff8406`be70bc40 ]
   +0xab0 AllocatedPortIndices : (null) 
   +0xab8 AllocatedPortIndicesLength : 0
   +0xabc NumberOfPorts    : 0
   +0xac0 NumberOfActivePorts : 0
   +0xac8 MiniportXmitLinkSpeed : 0x00000002`540be400
   +0xad0 MiniportRcvLinkSpeed : 0x00000002`540be400
   +0xad8 InitModeTimeoutTimer : _NDIS_TIMER
   +0xb58 InitModeTimeoutWorkItem : _NDIS_WORK_ITEM
   +0xba8 InitModeTimeoutTimerQueuedEvent : _KEVENT
   +0xbc0 DataBackFillSize : 0
   +0xbc4 ContextBackFillSize : 0
   +0xbc8 TopFilterRestartAttributes : _NDIS_RESTART_GENERAL_ATTRIBUTES
   +0xc20 TopRecvScaleCapabilities : _NDIS_RECEIVE_SCALE_CAPABILITIES
   +0xc34 NsiOpenReferences : 0
   +0xc38 ProcessingOpen   : (null) 
   +0xc40 NsiRequestsCompletedEvent : (null) 
   +0xc48 QueryPowerDeviceState : 0 ( PowerDeviceUnspecified )
   +0xc4c MinimumNdisMajorVersion : 0x6 ''
   +0xc4d MinimumNdisMinorVersion : 0x46 'F'
   +0xc50 BottomIfStats    : (null) 
   +0xc58 PeriodicReceiveQueue : _NDIS_M_PERIODIC_RECEIVES
   +0xce0 PeriodicReceivesNblCountIndex : 0xffffde81`0f9340f8 PNDIS_PER_PROCESSOR_SLOT__
   +0xce8 DefaultSendControlState : 2 ( NdisPortControlStateUncontrolled )
   +0xcec DefaultRcvControlState : 2 ( NdisPortControlStateUncontrolled )
   +0xcf0 DefaultSendAuthorizationState : 2 ( NdisPortUnauthorized )
   +0xcf4 DefaultRcvAuthorizationState : 2 ( NdisPortUnauthorized )
   +0xcf8 DefaultPortSendControlState : 2 ( NdisPortControlStateUncontrolled )
   +0xcfc DefaultPortRcvControlState : 2 ( NdisPortControlStateUncontrolled )
   +0xd00 DefaultPortSendAuthorizationState : 2 ( NdisPortUnauthorized )
   +0xd04 DefaultPortRcvAuthorizationState : 2 ( NdisPortUnauthorized )
   +0xd08 PciDeviceCustomProperties : _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES
   +0xd40 TopNdis5PacketIndicateHandler : 0xfffff806`24094370     void  NDIS!ethFilterDprIndicateReceivePacket+0
   +0xd48 ndisSupportedOidList : 0xffff8406`bf31f480  -> 0x10101
   +0xd50 ndisSupportedOidListLength : 0x160
   +0xd54 MsiIntCount      : 0
   +0xd58 MiniportDpcWorkItem : _WORK_QUEUE_ITEM
   +0xd78 InvalidFrames    : 0
   +0xd80 PagingPathCount  : 0n0
   +0xd88 ReceiveQueueList : _LIST_ENTRY [ 0xffff8406`be70bf28 - 0xffff8406`be70bf28 ]
   +0xd98 AllocatedQueueIndices : (null) 
   +0xda0 AllocatedQueueIndicesLength : 0
   +0xda4 NumReceiveQueues : 0
   +0xda8 ReceiveFilterList : _LIST_ENTRY [ 0xffff8406`be70bf48 - 0xffff8406`be70bf48 ]
   +0xdb8 AllocatedReceiveFilterIndices : (null) 
   +0xdc0 AllocatedReceiveFilterIndicesLength : 0
   +0xdc4 NumReceiveFilters : 0
   +0xdc8 EnabledReceiveFilterTypes : 0
   +0xdcc EnabledReceiveQueueTypes : 0
   +0xdd0 ReceiveFilterHwCapabilities : (null) 
   +0xdd8 ReceiveFilterCurrentCapabilities : (null) 
   +0xde0 TopReceiveFilterCurrentCapabilities : (null) 
   +0xde8 NicSwitchHwCapabilities : (null) 
   +0xdf0 NicSwitchCurrentCapabilities : (null) 
   +0xdf8 TopNicSwitchCurrentCapabilities : (null) 
   +0xe00 SharedMemoryBlockList : _LIST_ENTRY [ 0xffff8406`be70bfa0 - 0xffff8406`be70bfa0 ]
   +0xe10 AllocateSharedMemoryHandler : (null) 
   +0xe18 FreeSharedMemoryHandler : (null) 
   +0xe20 AllocateSharedMemoryContext : (null) 
   +0xe28 MsiCaps          : PCI_MSI_CAPABILITY
   +0xe40 MsiXCaps         : PCI_MSIX_CAPABILITY
   +0xe50 NumberOfIndirectionTableChanges : 0
   +0xe58 PciDeviceSriovSupport : 0
   +0xe5c BeginSavedFields : 0 ''
   +0xe5c NumUserOpens     : 0
   +0xe60 OffloadRegistry  : _NDIS_MINIPORT_OFFLOAD_REG
   +0xe64 MediaDisconnectTimeOut : 0x14
   +0xe66 SGMapRegistersNeeded : 0x10
   +0xe68 DriverVerifyFlags : 0
   +0xe70 SetBusData       : (null) 
   +0xe78 GetBusData       : (null) 
   +0xe80 BusDataContext   : (null) 
   +0xe88 BusType          : f ( PNPBus )
   +0xe8c BusNumber        : 0
   +0xe90 OpenReadyEvent   : _NDIS_EVENT
   +0xea8 NumAdminOpens    : 0
   +0xeb0 DriverHandle     : 0xffff8406`be6ac940 _NDIS_M_DRIVER_BLOCK
   +0xeb8 BindPaths        : 0xffff8406`be51fb40 _NDIS_BIND_PATHS
   +0xec0 MiniportPhysicalMediumType : 0 ( NdisPhysicalMediumUnspecified )
   +0xec8 SecurityDescriptor : 0xffff8406`be51f500 Void
   +0xed0 BaseName         : _UNICODE_STRING "{EB5F55FA-BD2D-4AB8-ABD6-CBA5562ECDCD}"
   +0xee0 MiniportName     : _UNICODE_STRING "\DEVICE\{EB5F55FA-BD2D-4AB8-ABD6-CBA5562ECDCD}"
   +0xef0 DeviceObject     : 0xffff8406`be70b050 _DEVICE_OBJECT
   +0xef8 PhysicalDeviceObject : 0xffff8406`bcf9d7f0 _DEVICE_OBJECT
   +0xf00 NextDeviceObject : 0xffff8406`bcf9d7f0 _DEVICE_OBJECT
   +0xf08 NextGlobalMiniport : (null) 
   +0xf10 pAdapterInstanceName : 0xffff8406`be1c4750 _UNICODE_STRING "Microsoft Hyper-V Network Adapter #2"
   +0xf18 PnPCapabilities  : 0x10000010
   +0xf1c CurrentDevicePowerState : 1 ( PowerDeviceD0 )
   +0xf20 PowerStateLock   : 0
   +0xf28 DriverPowerState : 1 ( PowerDeviceD0 )
   +0xf2c PrevDriverPowerState : 0 ( PowerDeviceUnspecified )
   +0xf30 LowPowerRcvReturnNbls : (null) 
   +0xf38 PendingReturnNBLCount : 0
   +0xf3c SurpriseRemoveFlushedRcvReturnQueue : 0 ''
   +0xf40 LowPowerRcvReturnNblTracker : (null) 
   +0xf48 PMAdminConfig    : _NDIS_PM_ADMIN_CONFIG
   +0xf50 PMPatternSemaphore : _KSEMAPHORE
   +0xf70 PMOffloadSemaphore : _KSEMAPHORE
   +0xf90 BusInterface     : (null) 
   +0xf98 InstanceNumber   : 1
   +0xfa0 ConfigurationHandle : 0xffff8406`be51e880 Void
   +0xfa8 InterfaceGuid    : _GUID {eb5f55fa-bd2d-4ab8-abd6-cba5562ecdcd}
   +0xfb8 NetLuid          : _NET_LUID_LH
   +0xfc0 IfBlockAvailable : 0x1 ''
   +0xfc8 IfBlock          : 0xffff8406`be0dd760 _NDIS_IF_BLOCK
   +0xfd0 IfBlockPointerRefZeroEvent : (null) 
   +0xfd8 IfIndex          : 0xf
   +0xfdc AdminStatus      : 1 ( NET_IF_ADMIN_STATUS_UP )
   +0xfe0 OperStatus       : 1 ( NET_IF_OPER_STATUS_UP )
   +0xfe4 OperStatusFlags  : 0
   +0xfe8 SendHandler      : (null) 
   +0xfe8 WanSendHandler   : (null) 
   +0xff0 NblTracker       : 0xffff8406`be7271b1 NDIS_NBL_TRACKER_HANDLE__
   +0xff8 ReenumerateSelfInterface : (null) 
   +0x1000 Offload          : 0xffff8406`bfda1010 _NDIS_MINIPORT_OFFLOAD
   +0x1008 NDKBlock         : (null) 
   +0x1010 AddDeviceContext : (null) 
   +0x1018 RemoveLock       : _IO_REMOVE_LOCK
   +0x1038 DevinterfaceNetSymbolicLinkName : _UNICODE_STRING "\??\VMBUS#{f8615163-df3e-46c5-913f-f2d2f965ed0e}#{cb490da4-b548-49a5-b581-857663264247}#{cac88484-7515-4c03-82e6-71a87abac361}"
   +0x1048 PhysicalMediumInInf : 0
   +0x1050 ExportName       : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x1058 FilterClass      : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x1060 StatusProcessingThread : (null) 
   +0x1068 FdoName          : _UNICODE_STRING "\Device\NDMP1"
   +0x1078 PowerD0CompleteEvent : _KEVENT
   +0x1090 LastD0CompleteStatus : 0n0
   +0x1094 LastD0Reason     : 0 ( NdisMEvent_Unknown )
   +0x1098 DirectOidRequestCount : 0
   +0x10a0 AllDirectRequestsCompletedEvent : (null) 
   +0x10a8 HDSplitCurrentConfig : (null) 
   +0x10b0 MSIXConfigContext : (null) 
   +0x10b8 SetMSIXTableEntry : (null) 
   +0x10c0 MaskMSIXTableEntry : (null) 
   +0x10c8 UnmaskMSIXTableEntry : (null) 
   +0x10d0 DevicePowerStateWorkItem : _WORK_QUEUE_ITEM
   +0x10f0 SystemPowerStateWorkItem : _WORK_QUEUE_ITEM
   +0x1110 DefaultReceiveQueue : 0xffff8406`be685010 _NDIS_RECEIVE_QUEUE_BLOCK
   +0x1118 MaxNumRssProcessors : 2
   +0x111c RssBaseProcessor : _PROCESSOR_NUMBER
   +0x1120 RssMaxProcessor  : _PROCESSOR_NUMBER
   +0x1124 RssProfile       : 4 ( NdisRssProfileNumaStatic )
   +0x1128 NumaNodeId       : 0
   +0x1130 NumaDistances    : 0xffff8406`be0e9bf0  -> 0
   +0x1138 pModifiedInstanceName : (null) 
   +0x1140 SyncFlags        : 0
   +0x1144 WSyncFlags       : 0
   +0x1148 InterlockedFlags : 0
   +0x1150 Ref              : _ULONG_REFERENCE
   +0x1160 SelectiveSuspend : (null) 
   +0x1168 AoAc             : (null) 
   +0x1170 LastWakeReason   : 0 ( NdisWakeReasonUnspecified )
   +0x1178 PnpEventLog      : 0xffff8406`be1ccea0 NDIS_EVENT_LOG_HANDLE__
   +0x1180 D0CompleteSignalWorkItem : _NDIS_D0_SIGNAL_WORK_ITEM
   +0x11d8 PhysicalPerformanceCounters : 0xffff8406`be534f60 _NDIS_PHYSICAL_PERFORMANCE_COUNTERS
   +0x11e0 TimeOfInitialization : _LARGE_INTEGER 0x01dbcf73`c0ae5c18
   +0x11e8 LastSystemSleepTime : _LARGE_INTEGER 0x0
   +0x11f0 TotalSystemSleepTimeMs : 0
   +0x11f8 SriovHwCapabilities : (null) 
   +0x1200 SriovCurrentCapabilities : (null) 
   +0x1208 TopSriovCurrentCapabilities : (null) 
   +0x1210 InvalidateBlockMask : 0
   +0x1218 InvalidateBlockIoctlPf : (null) 
   +0x1220 InvalidateBlockIoctlVf : (null) 
   +0x1228 InvalidateBlockVfParams : _VPCI_INVALIDATE_BLOCK_OUTPUT
   +0x1230 InvalidateBlockEvent : _KEVENT
   +0x1248 InvalidateVfId   : 0
   +0x124a InvalidateBlockCancelling : 0 ''
   +0x124b AllowMultipleVPortsPerVF : 0 ''
   +0x1250 PFBlock          : (null) 
   +0x1258 NumSwitches      : 0
   +0x1260 NicSwitchList    : _LIST_ENTRY [ 0xffff8406`be70c400 - 0xffff8406`be70c400 ]
   +0x1270 NumAllocatedVFs  : 0
   +0x1278 VFList           : _LIST_ENTRY [ 0xffff8406`be70c418 - 0xffff8406`be70c418 ]
   +0x1288 NumActiveVPorts  : 0
   +0x1290 VPortList        : _LIST_ENTRY [ 0xffff8406`be70c430 - 0xffff8406`be70c430 ]
   +0x12a0 AllocatedVPortIndices : (null) 
   +0x12a8 AllocatedVPortIndicesLength : 0
   +0x12b0 SetVirtualFunctionData : (null) 
   +0x12b8 GetVirtualFunctionData : (null) 
   +0x12c0 EnableVirtualization : (null) 
   +0x12c8 GetVirtualDeviceLocation : (null) 
   +0x12d0 GetVirtualFunctionProbedBars : (null) 
   +0x12d8 VirtInterfaceContext : (null) 
   +0x12e0 DevinterfaceVirtSymbolicLinkName : _UNICODE_STRING ""
   +0x12f0 VpciInterfaceDereference : (null) 
   +0x12f8 WriteVfConfigBlock : (null) 
   +0x1300 ReadVfConfigBlock : (null) 
   +0x1308 VpciInterfaceContext : (null) 
   +0x1310 VfSerialNumber   : 0
   +0x1314 SriovLuid        : _LUID
   +0x1320 RefCountTracker  : 0xffff8406`be537690 NDIS_REFCOUNT_HANDLE__
   +0x1328 NsiRefCountTracker : 0xffff8406`be537c60 NDIS_REFCOUNT_HANDLE__
   +0x1330 QosHwCapabilities : (null) 
   +0x1338 QosCurrentCapabilities : (null) 
   +0x1340 QosOperationalParameters : (null) 
   +0x1348 QosOperationalParametersBufferSize : 0
   +0x1350 QosRemoteParameters : (null) 
   +0x1358 QosRemoteParametersBufferSize : 0
   +0x1360 DeviceFlags      : 0
   +0x1368 VerifierContext  : (null) 
   +0x1370 SurpriseRemovalWorkItem : WORKITEM_WITH_IRP
   +0x1398 Bindings         : Ndis::BindStack
   +0x1400 BindEngine       : Ndis::BindEngine
   +0x1478 MiniportOwner    : Rtl::KNeutralLock<enum NDIS_MINIPORT_POLICY_OWNER>
   +0x14a0 PmInterruptedByPnp : 0
   +0x14a1 DoNotBlockOnMiniportLock : 0
   +0x14a2 PoFxDStateReportingEnabled : 0
   +0x14a8 HookAdapterHandle : (null) 
   +0x14b0 InterfaceUpdateWorkItem : _WORK_QUEUE_ITEM
   +0x14d0 InterfaceUpdateInProgress : 0
   +0x14d1 MacAddressUpdateQueued : 0
   +0x14d2 MtuUpdateQueued  : 0
   +0x14d4 PendingMacAddress : _IF_PHYSICAL_ADDRESS_LH
   +0x14f8 PendingMtuSize   : 0
   +0x1500 PnPInstanceId    : 0xffff8406`be663420  "VMBUS\{f8615163-df3e-46c5-913f-f2d2f965ed0e}\{cb490da4-b548-49a5-b581-857663264247}"
   +0x1508 DevicePowerOnWorkItem : WORKITEM_WITH_IRP
   +0x1530 DevicePowerDownWorkItem : WORKITEM_WITH_IRP
   +0x1558 PendingOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x1560 HookedOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x1568 ReenumerateWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x1570 PDBlock          : 0xffff8406`be1c4980 _NDIS_PD_BLOCK
   +0x1578 PdcHandle        : (null) 
   +0x1580 PdcTaskClientDisableTimer : _NDIS_TIMER
   +0x1600 PdcTaskClientDisableWorkItem : _NDIS_WORK_ITEM
   +0x1650 PdcTaskClientMode : 0n0
   +0x1654 ModernStandbyWoLMagicPacketEnable : 0
   +0x1658 RssV2Context     : 0xffff8406`bf338040 _NDIS_RSS_DPC_WORKER_CONTEXT
   +0x1660 RssV2CompletionCount : 0n0
   +0x1668 RssV2CompletionEvent : _KEVENT
   +0x1680 RssV2Initialized : 0 ''
   +0x1688 SynchronousOidCalls : _LIST_ENTRY [ 0xffff8406`be70c828 - 0xffff8406`be70c828 ]
   +0x1698 HwTimestampCapabilities : (null) 
   +0x16a0 HwTimestampCurrentConfig : (null) 
   +0x16a8 TopTimestampConfig : (null) 
   +0x16b0 TopHwTimestampCapabilities : (null) 
   +0x16b8 PktMonComp       : _PKTMON_COMPONENT_CONTEXT
   +0x16f8 PktMonEdge       : _PKTMON_EDGE_CONTEXT
   +0x1720 PollModeConfigKnobsNamespace : KnobNamespace
   +0x1768 PollModeConfigKnobDescriptors : Rtl::KArray<KnobDescriptor,1>
   +0x1778 PollModeConfigKnobs : _EXECUTION_CONTEXT_RUNTIME_KNOBS
   +0x17b4 PnPActivityID    : _GUID {bb38ed86-cf73-0000-2aee-38bb73cfdb01}
   +0x17c8 IdleSm           : wistd::unique_ptr<NdisWdfIdle,KFreePoolNP<NdisWdfIdle> >
   +0x17d0 HasConversionFilter : 0
