
C:\Users\user\Desktop\bin>AntiHook.exe EnumNdisGlobalFilterList
Number:6

Index:1
Offset:000 Length:004 Name:Header
        Type:5
        Revision:1
        Size:1416
Offset:008 Length:008 Name:NextFilter                                   俺不关心这个，暂不处理
Offset:010 Length:008 Name:FilterDriver                                 俺不关心这个，暂不处理
Offset:018 Length:008 Name:FilterModuleContext                          Value:FFFFD30637242620
Offset:020 Length:008 Name:Miniport                                     俺不关心这个，暂不处理
Offset:028 Length:008 Name:FilterInstanceName                           Value:{AAF79E81-F0B3-424D-8974-27FCEB50ADF5}-{B70D6460-3635-4D42-B866-B8AB1A24454C}-0000
Offset:030 Length:008 Name:FilterFriendlyName                           Value:Microsoft Hyper-V Network Adapter #3-WFP 802.3 MAC Layer LightWeight Filter-0000
Offset:038 Length:004 Name:Flags                                        俺不关心这个，暂不处理
Offset:03c Length:004 Name:StackFlags                                   俺不关心这个，暂不处理
Offset:040 Length:001 Name:State                                        俺不关心这个，暂不处理 StructName:_NDIS_FILTER_STATE
Offset:048 Length:018 Name:Ref                                          俺不关心这个，暂不处理 StructName:_REFERENCE_EX
Offset:060 Length:004 Name:FakeStatus                                   俺不关心这个，暂不处理
Offset:068 Length:008 Name:NextGlobalFilter                             俺不关心这个，暂不处理

Offset:280 Length:008 Name:FilterCancelSendNetBufferListsHandler        Value:FFFFF8053615A9F0 FullPathName:\SystemRoot\System32\drivers\NDIS.SYS
Offset:288 Length:008 Name:NblTracker                                   俺不关心这个，暂不处理
Offset:290 Length:008 Name:Offload                                      俺不关心这个，暂不处理
Offset:298 Length:010 Name:InterfaceGuid                                俺不关心这个，暂不处理 StructName:_GUID
Offset:2a8 Length:004 Name:IfIndex                                      俺不关心这个，暂不处理
Offset:2b0 Length:008 Name:IfBlock                                      俺不关心这个，暂不处理
Offset:2b8 Length:008 Name:NextDirectRequestHandle                      Value:FFFFD306363851A0
Offset:2c0 Length:004 Name:DirectOidRequestCount                        俺不关心这个，暂不处理
Offset:2c8 Length:008 Name:WOLPatternList                               俺不关心这个，暂不处理 StructName:_SINGLE_LIST_ENTRY
Offset:2d0 Length:008 Name:PMProtocolOffloadList                        俺不关心这个，暂不处理 StructName:_SINGLE_LIST_ENTRY
Offset:2d8 Length:014 Name:PMCurrentParameters                          俺不关心这个，暂不处理 StructName:_NDIS_PM_PARAMETERS
Offset:2f0 Length:008 Name:Bind                                         俺不关心这个，暂不处理
Offset:2f8 Length:008 Name:HwTimestampCapabilities                      俺不关心这个，暂不处理
Offset:300 Length:008 Name:HwTimestampCurrentConfig                     俺不关心这个，暂不处理
Offset:308 Length:008 Name:VerifierContext                              Value:0000000000000000
Offset:310 Length:040 Name:PktMonComp                                   俺不关心这个，暂不处理 StructName:_PKTMON_COMPONENT_CONTEXT
Offset:350 Length:028 Name:PktMonEdgeLower                              俺不关心这个，暂不处理 StructName:_PKTMON_EDGE_CONTEXT
Offset:378 Length:028 Name:PktMonEdgeUpper                              俺不关心这个，暂不处理 StructName:_PKTMON_EDGE_CONTEXT
Offset:3a0 Length:020 Name:NblContextVerifierContext                    俺不关心这个，暂不处理 StructName:_NBL_CONTEXT_VERIFIER_CONTEXT
Offset:3c0 Length:00c Name:SriovHwCapabilities                          俺不关心这个，暂不处理 StructName:_NDIS_SRIOV_CAPABILITIES
Offset:3cc Length:00c Name:SriovCurrentCapabilities                     俺不关心这个，暂不处理 StructName:_NDIS_SRIOV_CAPABILITIES
Offset:3d8 Length:084 Name:NicSwitchHwCapabilities                      俺不关心这个，暂不处理 StructName:_NDIS_NIC_SWITCH_CAPABILITIES
Offset:45c Length:084 Name:NicSwitchCurrentCapabilities                 俺不关心这个，暂不处理 StructName:_NDIS_NIC_SWITCH_CAPABILITIES
Offset:4e0 Length:054 Name:ReceiveFilterHwCapabilities                  俺不关心这个，暂不处理 StructName:_NDIS_RECEIVE_FILTER_CAPABILITIES
Offset:534 Length:054 Name:ReceiveFilterCurrentCapabilities             俺不关心这个，暂不处理 StructName:_NDIS_RECEIVE_FILTER_CAPABILITIES

---------------------------------------------------------------------------------------


C:\Users\user\Desktop\bin>


上面是程序输出
下面是工具验证


0: kd> .for (r $t0 = poi(ndis!ndisGlobalFilterList); @$t0 != 0; r $t0 = poi(@$t0 + @@(#FIELD_OFFSET(ndis!_NDIS_FILTER_BLOCK, NextGlobalFilter)))) { dt ndis!_NDIS_FILTER_BLOCK @$t0 }
   +0x000 Header           : _NDIS_OBJECT_HEADER
   +0x008 NextFilter       : 0xffffd306`37227a00 _NDIS_FILTER_BLOCK
   +0x010 FilterDriver     : 0xffffd306`36064cf0 _NDIS_FILTER_DRIVER_BLOCK
   +0x018 FilterModuleContext : 0xffffd306`37242620 Void
   +0x020 Miniport         : 0xffffd306`3637e1a0 _NDIS_MINIPORT_BLOCK
   +0x028 FilterInstanceName : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x030 FilterFriendlyName : 0xffffd306`371611e0 _UNICODE_STRING "Microsoft Hyper-V Network Adapter #3-WFP 802.3 MAC Layer LightWeight Filter-0000"
   +0x038 Flags            : 0x10
   +0x03c StackFlags       : 0
   +0x040 State            : 4 ( NdisFilterRunning )
   +0x048 Ref              : _REFERENCE_EX
   +0x060 FakeStatus       : 0n-1071448033
   +0x068 NextGlobalFilter : 0xffffd306`3723f620 _NDIS_FILTER_BLOCK
   +0x070 LowerFilter      : 0xffffd306`3723f620 _NDIS_FILTER_BLOCK
   +0x078 HigherFilter     : (null) 
   +0x080 AsyncOpContext   : (null) 
   +0x088 NumOfPauseRestartRequests : 0n0
   +0x090 Lock             : 0
   +0x098 LockThread       : (null) 
   +0x0a0 OidRequestList   : _LIST_ENTRY [ 0xffffd306`372410b0 - 0xffffd306`372410b0 ]
   +0x0b0 PendingOidRequest : (null) 
   +0x0b8 PendingOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x0c0 StackExpansionFallback : _NDIS_FILTER_BLOCK::<unnamed-type-StackExpansionFallback>
   +0x120 StatusIndicationsQueued : 0 ''
   +0x124 DroppedReceiveNbls : 0n0
   +0x128 DroppedSendNbls  : 0n0
   +0x12c DroppedStatusIndications : 0
   +0x130 DroppedUncloneableStatusIndications : 0
   +0x138 PnPRef           : _REFERENCE_EX
   +0x150 MediaType        : 0 ( NdisMedium802_3 )
   +0x154 PhysicalMediaType : 0 ( NdisPhysicalMediumUnspecified )
   +0x158 MediaConnectState : 2 ( MediaConnectStateDisconnected )
   +0x15c MediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x160 XmitLinkSpeed    : 0x00000002`540be400
   +0x168 RcvLinkSpeed     : 0x00000002`540be400
   +0x170 PauseFunctions   : 0 ( NdisPauseFunctionsUnsupported )
   +0x174 AutoNegotiationFlags : 0
   +0x178 XState           : 0x1 ''
   +0x179 Reserved1        : 0 ''
   +0x17a Reserved2        : 0 ''
   +0x17b Reserved3        : 0 ''
   +0x17c MediaConnectStateIndicateUp : 2 ( MediaConnectStateDisconnected )
   +0x180 MediaDuplexStateIndicateUp : 0 ( MediaDuplexStateUnknown )
   +0x188 XmitLinkSpeedIndicateUp : 0x00000002`540be400
   +0x190 RcvLinkSpeedIndicateUp : 0x00000002`540be400
   +0x198 PauseFunctionsIndicateUp : 0 ( NdisPauseFunctionsUnsupported )
   +0x19c AutoNegotiationFlagsIndicateUp : 0
   +0x1a0 NextRequestHandle : 0xffffd306`3723f620 Void
   +0x1a8 IterativeDataPathTracker : (null) 
   +0x1b0 NextSendNetBufferListsHandler : 0xfffff805`36e97ce0     void  +fffff80536e97ce0
   +0x1b8 NextSendNetBufferListsContext : 0xffffd306`3723bbf0 Void
   +0x1c0 NextSendNetBufferListsTracker : 0xffffd306`361c6e31 NDIS_NBL_TRACKER_HANDLE__
   +0x1c8 NextSendNetBufferListsObject : 0xffffd306`3723e010 _NDIS_OBJECT_HEADER
   +0x1d0 NextSendNetBufferListsCompleteHandler : 0xfffff805`36105080     void  NDIS!ndisMSendCompleteNetBufferListsInternal+0
   +0x1d8 NextSendNetBufferListsCompleteContext : 0xffffd306`3637e1a0 Void
   +0x1e0 NextSendNetBufferListsCompleteTracker : 0x00000000`00000030 NDIS_NBL_TRACKER_HANDLE__
   +0x1e8 NextSendNetBufferListsCompleteObject : 0xffffd306`3637e1a0 _NDIS_OBJECT_HEADER
   +0x1f0 NextIndicateReceiveNetBufferListsHandler : 0xfffff805`360dd460     void  NDIS!ndisMTopReceiveNetBufferLists+0
   +0x1f8 NextIndicateReceiveNetBufferListsContext : 0xffffd306`3637e1a0 Void
   +0x200 NextIndicateReceiveNetBufferListsTracker : 0x00000000`00000020 NDIS_NBL_TRACKER_HANDLE__
   +0x208 NextIndicateReceiveNetBufferListsObject : 0xffffd306`3637e1a0 _NDIS_OBJECT_HEADER
   +0x210 NextReturnNetBufferListsHandler : 0xfffff805`36e917d0     void  +fffff80536e917d0
   +0x218 NextReturnNetBufferListsContext : 0xffffd306`3723bbf0 Void
   +0x220 NextReturnNetBufferListsTracker : 0xffffd306`361c6e31 NDIS_NBL_TRACKER_HANDLE__
   +0x228 NextReturnNetBufferListsObject : 0xffffd306`3723e010 _NDIS_OBJECT_HEADER
   +0x230 NextCancelSendNetBufferListsHandler : 0xfffff805`3618b540     void  NDIS!ndisMCancelSendNetBufferListsOnMiniport+0
   +0x238 NextCancelSendNetBufferListsContext : 0xffffd306`3637e1a0 Void
   +0x240 Characteristics  : _NDIS_FILTER_PARTIAL_CHARACTERISTICS
   +0x270 FilterSendNetBufferListsHandler : 0xfffff805`36152e00     void  NDIS!ndisFakeFilterSendHandler+0
   +0x278 FilterIndicateReceiveNetBufferListsHandler : 0xfffff805`36162e90     void  NDIS!ndisFakeFilterReceiveHandler+0
   +0x280 FilterCancelSendNetBufferListsHandler : 0xfffff805`3615c860     void  NDIS!ndis6DummyReceiveComplete+0
   +0x288 NblTracker       : 0xffffd306`361c7c71 NDIS_NBL_TRACKER_HANDLE__
   +0x290 Offload          : 0xffffd306`36820050 _NDIS_FILTER_TASK_OFFLOAD
   +0x298 InterfaceGuid    : _GUID {a8de4568-3855-11f0-a4c5-806e6f6e6963}
   +0x2a8 IfIndex          : 0x16
   +0x2b0 IfBlock          : 0xffffd306`37242010 _NDIS_IF_BLOCK
   +0x2b8 NextDirectRequestHandle : 0xffffd306`3637e1a0 Void
   +0x2c0 DirectOidRequestCount : 0
   +0x2c8 WOLPatternList   : _SINGLE_LIST_ENTRY
   +0x2d0 PMProtocolOffloadList : _SINGLE_LIST_ENTRY
   +0x2d8 PMCurrentParameters : _NDIS_PM_PARAMETERS
   +0x2f0 Bind             : 0xffff8586`6396edc0 NDIS_BIND_FILTER_LINK
   +0x2f8 HwTimestampCapabilities : (null) 
   +0x300 HwTimestampCurrentConfig : (null) 
   +0x308 VerifierContext  : (null) 
   +0x310 PktMonComp       : _PKTMON_COMPONENT_CONTEXT
   +0x350 PktMonEdgeLower  : _PKTMON_EDGE_CONTEXT
   +0x378 PktMonEdgeUpper  : _PKTMON_EDGE_CONTEXT
   +0x3a0 NblContextVerifierContext : _NBL_CONTEXT_VERIFIER_CONTEXT
   +0x3c0 SriovHwCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3cc SriovCurrentCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3d8 NicSwitchHwCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x45c NicSwitchCurrentCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x4e0 ReceiveFilterHwCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x534 ReceiveFilterCurrentCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x000 Header           : _NDIS_OBJECT_HEADER
   +0x008 NextFilter       : 0xffffd306`37226010 _NDIS_FILTER_BLOCK
   +0x010 FilterDriver     : 0xffffd306`363ddde0 _NDIS_FILTER_DRIVER_BLOCK
   +0x018 FilterModuleContext : 0xffffd306`361c3360 Void
   +0x020 Miniport         : 0xffffd306`3637e1a0 _NDIS_MINIPORT_BLOCK
   +0x028 FilterInstanceName : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x030 FilterFriendlyName : 0xffffd306`36cff140 _UNICODE_STRING "Microsoft Hyper-V Network Adapter #3-QoS Packet Scheduler-0000"
   +0x038 Flags            : 0x10
   +0x03c StackFlags       : 1
   +0x040 State            : 4 ( NdisFilterRunning )
   +0x048 Ref              : _REFERENCE_EX
   +0x060 FakeStatus       : 0n-1071448033
   +0x068 NextGlobalFilter : 0xffffd306`3723e010 _NDIS_FILTER_BLOCK
   +0x070 LowerFilter      : 0xffffd306`3723e010 _NDIS_FILTER_BLOCK
   +0x078 HigherFilter     : 0xffffd306`37241010 _NDIS_FILTER_BLOCK
   +0x080 AsyncOpContext   : (null) 
   +0x088 NumOfPauseRestartRequests : 0n0
   +0x090 Lock             : 0
   +0x098 LockThread       : (null) 
   +0x0a0 OidRequestList   : _LIST_ENTRY [ 0xffffd306`3723f6c0 - 0xffffd306`3723f6c0 ]
   +0x0b0 PendingOidRequest : (null) 
   +0x0b8 PendingOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x0c0 StackExpansionFallback : _NDIS_FILTER_BLOCK::<unnamed-type-StackExpansionFallback>
   +0x120 StatusIndicationsQueued : 0 ''
   +0x124 DroppedReceiveNbls : 0n0
   +0x128 DroppedSendNbls  : 0n0
   +0x12c DroppedStatusIndications : 0
   +0x130 DroppedUncloneableStatusIndications : 0
   +0x138 PnPRef           : _REFERENCE_EX
   +0x150 MediaType        : 0 ( NdisMedium802_3 )
   +0x154 PhysicalMediaType : 0 ( NdisPhysicalMediumUnspecified )
   +0x158 MediaConnectState : 2 ( MediaConnectStateDisconnected )
   +0x15c MediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x160 XmitLinkSpeed    : 0x00000002`540be400
   +0x168 RcvLinkSpeed     : 0x00000002`540be400
   +0x170 PauseFunctions   : 0 ( NdisPauseFunctionsUnsupported )
   +0x174 AutoNegotiationFlags : 0
   +0x178 XState           : 0x1 ''
   +0x179 Reserved1        : 0 ''
   +0x17a Reserved2        : 0 ''
   +0x17b Reserved3        : 0 ''
   +0x17c MediaConnectStateIndicateUp : 2 ( MediaConnectStateDisconnected )
   +0x180 MediaDuplexStateIndicateUp : 0 ( MediaDuplexStateUnknown )
   +0x188 XmitLinkSpeedIndicateUp : 0x00000002`540be400
   +0x190 RcvLinkSpeedIndicateUp : 0x00000002`540be400
   +0x198 PauseFunctionsIndicateUp : 0 ( NdisPauseFunctionsUnsupported )
   +0x19c AutoNegotiationFlagsIndicateUp : 0
   +0x1a0 NextRequestHandle : 0xffffd306`3723e010 Void
   +0x1a8 IterativeDataPathTracker : (null) 
   +0x1b0 NextSendNetBufferListsHandler : 0xfffff805`36e97ce0     void  +fffff80536e97ce0
   +0x1b8 NextSendNetBufferListsContext : 0xffffd306`3723bbf0 Void
   +0x1c0 NextSendNetBufferListsTracker : 0xffffd306`361c6e31 NDIS_NBL_TRACKER_HANDLE__
   +0x1c8 NextSendNetBufferListsObject : 0xffffd306`3723e010 _NDIS_OBJECT_HEADER
   +0x1d0 NextSendNetBufferListsCompleteHandler : 0xfffff805`36105080     void  NDIS!ndisMSendCompleteNetBufferListsInternal+0
   +0x1d8 NextSendNetBufferListsCompleteContext : 0xffffd306`3637e1a0 Void
   +0x1e0 NextSendNetBufferListsCompleteTracker : 0x00000000`00000030 NDIS_NBL_TRACKER_HANDLE__
   +0x1e8 NextSendNetBufferListsCompleteObject : 0xffffd306`3637e1a0 _NDIS_OBJECT_HEADER
   +0x1f0 NextIndicateReceiveNetBufferListsHandler : 0xfffff805`360dd460     void  NDIS!ndisMTopReceiveNetBufferLists+0
   +0x1f8 NextIndicateReceiveNetBufferListsContext : 0xffffd306`3637e1a0 Void
   +0x200 NextIndicateReceiveNetBufferListsTracker : 0x00000000`00000020 NDIS_NBL_TRACKER_HANDLE__
   +0x208 NextIndicateReceiveNetBufferListsObject : 0xffffd306`3637e1a0 _NDIS_OBJECT_HEADER
   +0x210 NextReturnNetBufferListsHandler : 0xfffff805`36e917d0     void  +fffff80536e917d0
   +0x218 NextReturnNetBufferListsContext : 0xffffd306`3723bbf0 Void
   +0x220 NextReturnNetBufferListsTracker : 0xffffd306`361c6e31 NDIS_NBL_TRACKER_HANDLE__
   +0x228 NextReturnNetBufferListsObject : 0xffffd306`3723e010 _NDIS_OBJECT_HEADER
   +0x230 NextCancelSendNetBufferListsHandler : 0xfffff805`3618b540     void  NDIS!ndisMCancelSendNetBufferListsOnMiniport+0
   +0x238 NextCancelSendNetBufferListsContext : 0xffffd306`3637e1a0 Void
   +0x240 Characteristics  : _NDIS_FILTER_PARTIAL_CHARACTERISTICS
   +0x270 FilterSendNetBufferListsHandler : 0xfffff805`36152e00     void  NDIS!ndisFakeFilterSendHandler+0
   +0x278 FilterIndicateReceiveNetBufferListsHandler : 0xfffff805`36162e90     void  NDIS!ndisFakeFilterReceiveHandler+0
   +0x280 FilterCancelSendNetBufferListsHandler : 0xfffff805`3615c860     void  NDIS!ndis6DummyReceiveComplete+0
   +0x288 NblTracker       : 0xffffd306`361c6bf1 NDIS_NBL_TRACKER_HANDLE__
   +0x290 Offload          : 0xffffd306`368219a0 _NDIS_FILTER_TASK_OFFLOAD
   +0x298 InterfaceGuid    : _GUID {a8de4567-3855-11f0-a4c5-806e6f6e6963}
   +0x2a8 IfIndex          : 0x15
   +0x2b0 IfBlock          : 0xffffd306`37240760 _NDIS_IF_BLOCK
   +0x2b8 NextDirectRequestHandle : 0xffffd306`3637e1a0 Void
   +0x2c0 DirectOidRequestCount : 0
   +0x2c8 WOLPatternList   : _SINGLE_LIST_ENTRY
   +0x2d0 PMProtocolOffloadList : _SINGLE_LIST_ENTRY
   +0x2d8 PMCurrentParameters : _NDIS_PM_PARAMETERS
   +0x2f0 Bind             : 0xffff8586`6396ec70 NDIS_BIND_FILTER_LINK
   +0x2f8 HwTimestampCapabilities : (null) 
   +0x300 HwTimestampCurrentConfig : (null) 
   +0x308 VerifierContext  : (null) 
   +0x310 PktMonComp       : _PKTMON_COMPONENT_CONTEXT
   +0x350 PktMonEdgeLower  : _PKTMON_EDGE_CONTEXT
   +0x378 PktMonEdgeUpper  : _PKTMON_EDGE_CONTEXT
   +0x3a0 NblContextVerifierContext : _NBL_CONTEXT_VERIFIER_CONTEXT
   +0x3c0 SriovHwCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3cc SriovCurrentCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3d8 NicSwitchHwCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x45c NicSwitchCurrentCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x4e0 ReceiveFilterHwCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x534 ReceiveFilterCurrentCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x000 Header           : _NDIS_OBJECT_HEADER
   +0x008 NextFilter       : 0xffffd306`37224520 _NDIS_FILTER_BLOCK
   +0x010 FilterDriver     : 0xffffd306`36063c80 _NDIS_FILTER_DRIVER_BLOCK
   +0x018 FilterModuleContext : 0xffffd306`3723bbf0 Void
   +0x020 Miniport         : 0xffffd306`3637e1a0 _NDIS_MINIPORT_BLOCK
   +0x028 FilterInstanceName : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x030 FilterFriendlyName : 0xffffd306`37162700 _UNICODE_STRING "Microsoft Hyper-V Network Adapter #3-WFP Native MAC Layer LightWeight Filter-0000"
   +0x038 Flags            : 0x10
   +0x03c StackFlags       : 0
   +0x040 State            : 4 ( NdisFilterRunning )
   +0x048 Ref              : _REFERENCE_EX
   +0x060 FakeStatus       : 0n-1071448033
   +0x068 NextGlobalFilter : 0xffffd306`37227a00 _NDIS_FILTER_BLOCK
   +0x070 LowerFilter      : (null) 
   +0x078 HigherFilter     : 0xffffd306`3723f620 _NDIS_FILTER_BLOCK
   +0x080 AsyncOpContext   : (null) 
   +0x088 NumOfPauseRestartRequests : 0n0
   +0x090 Lock             : 0
   +0x098 LockThread       : (null) 
   +0x0a0 OidRequestList   : _LIST_ENTRY [ 0xffffd306`3723e0b0 - 0xffffd306`3723e0b0 ]
   +0x0b0 PendingOidRequest : (null) 
   +0x0b8 PendingOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x0c0 StackExpansionFallback : _NDIS_FILTER_BLOCK::<unnamed-type-StackExpansionFallback>
   +0x120 StatusIndicationsQueued : 0 ''
   +0x124 DroppedReceiveNbls : 0n0
   +0x128 DroppedSendNbls  : 0n0
   +0x12c DroppedStatusIndications : 0
   +0x130 DroppedUncloneableStatusIndications : 0
   +0x138 PnPRef           : _REFERENCE_EX
   +0x150 MediaType        : 0 ( NdisMedium802_3 )
   +0x154 PhysicalMediaType : 0 ( NdisPhysicalMediumUnspecified )
   +0x158 MediaConnectState : 2 ( MediaConnectStateDisconnected )
   +0x15c MediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x160 XmitLinkSpeed    : 0x00000002`540be400
   +0x168 RcvLinkSpeed     : 0x00000002`540be400
   +0x170 PauseFunctions   : 0 ( NdisPauseFunctionsUnsupported )
   +0x174 AutoNegotiationFlags : 0
   +0x178 XState           : 0x1 ''
   +0x179 Reserved1        : 0 ''
   +0x17a Reserved2        : 0 ''
   +0x17b Reserved3        : 0 ''
   +0x17c MediaConnectStateIndicateUp : 2 ( MediaConnectStateDisconnected )
   +0x180 MediaDuplexStateIndicateUp : 0 ( MediaDuplexStateUnknown )
   +0x188 XmitLinkSpeedIndicateUp : 0x00000002`540be400
   +0x190 RcvLinkSpeedIndicateUp : 0x00000002`540be400
   +0x198 PauseFunctionsIndicateUp : 0 ( NdisPauseFunctionsUnsupported )
   +0x19c AutoNegotiationFlagsIndicateUp : 0
   +0x1a0 NextRequestHandle : 0xffffd306`3637e1a0 Void
   +0x1a8 IterativeDataPathTracker : 0xffffd306`3685f900 [4] _NDIS_ITERATIVE_DATA_PATH_TRACKER_ENTRY
   +0x1b0 NextSendNetBufferListsHandler : 0xfffff805`360f5370     void  NDIS!ndisMSendNBLToMiniport+0
   +0x1b8 NextSendNetBufferListsContext : 0xffffd306`3637e1a0 Void
   +0x1c0 NextSendNetBufferListsTracker : 0xffffd306`361c4a31 NDIS_NBL_TRACKER_HANDLE__
   +0x1c8 NextSendNetBufferListsObject : 0xffffd306`3637e1a0 _NDIS_OBJECT_HEADER
   +0x1d0 NextSendNetBufferListsCompleteHandler : 0xfffff805`36105080     void  NDIS!ndisMSendCompleteNetBufferListsInternal+0
   +0x1d8 NextSendNetBufferListsCompleteContext : 0xffffd306`3637e1a0 Void
   +0x1e0 NextSendNetBufferListsCompleteTracker : 0x00000000`00000030 NDIS_NBL_TRACKER_HANDLE__
   +0x1e8 NextSendNetBufferListsCompleteObject : 0xffffd306`3637e1a0 _NDIS_OBJECT_HEADER
   +0x1f0 NextIndicateReceiveNetBufferListsHandler : 0xfffff805`360dd460     void  NDIS!ndisMTopReceiveNetBufferLists+0
   +0x1f8 NextIndicateReceiveNetBufferListsContext : 0xffffd306`3637e1a0 Void
   +0x200 NextIndicateReceiveNetBufferListsTracker : 0x00000000`00000020 NDIS_NBL_TRACKER_HANDLE__
   +0x208 NextIndicateReceiveNetBufferListsObject : 0xffffd306`3637e1a0 _NDIS_OBJECT_HEADER
   +0x210 NextReturnNetBufferListsHandler : 0xfffff805`37d95a10     void  +fffff80537d95a10
   +0x218 NextReturnNetBufferListsContext : 0xffffd306`363a2180 Void
   +0x220 NextReturnNetBufferListsTracker : 0xffffd306`361c4a31 NDIS_NBL_TRACKER_HANDLE__
   +0x228 NextReturnNetBufferListsObject : 0xffffd306`3637e1a0 _NDIS_OBJECT_HEADER
   +0x230 NextCancelSendNetBufferListsHandler : 0xfffff805`3618b540     void  NDIS!ndisMCancelSendNetBufferListsOnMiniport+0
   +0x238 NextCancelSendNetBufferListsContext : 0xffffd306`3637e1a0 Void
   +0x240 Characteristics  : _NDIS_FILTER_PARTIAL_CHARACTERISTICS
   +0x270 FilterSendNetBufferListsHandler : 0xfffff805`36152e00     void  NDIS!ndisFakeFilterSendHandler+0
   +0x278 FilterIndicateReceiveNetBufferListsHandler : 0xfffff805`36162e90     void  NDIS!ndisFakeFilterReceiveHandler+0
   +0x280 FilterCancelSendNetBufferListsHandler : 0xfffff805`3615c860     void  NDIS!ndis6DummyReceiveComplete+0
   +0x288 NblTracker       : 0xffffd306`361c6e31 NDIS_NBL_TRACKER_HANDLE__
   +0x290 Offload          : 0xffffd306`36820320 _NDIS_FILTER_TASK_OFFLOAD
   +0x298 InterfaceGuid    : _GUID {a8de4566-3855-11f0-a4c5-806e6f6e6963}
   +0x2a8 IfIndex          : 0x14
   +0x2b0 IfBlock          : 0xffffd306`3723f010 _NDIS_IF_BLOCK
   +0x2b8 NextDirectRequestHandle : 0xffffd306`3637e1a0 Void
   +0x2c0 DirectOidRequestCount : 0
   +0x2c8 WOLPatternList   : _SINGLE_LIST_ENTRY
   +0x2d0 PMProtocolOffloadList : _SINGLE_LIST_ENTRY
   +0x2d8 PMCurrentParameters : _NDIS_PM_PARAMETERS
   +0x2f0 Bind             : 0xffff8586`63970330 NDIS_BIND_FILTER_LINK
   +0x2f8 HwTimestampCapabilities : (null) 
   +0x300 HwTimestampCurrentConfig : (null) 
   +0x308 VerifierContext  : (null) 
   +0x310 PktMonComp       : _PKTMON_COMPONENT_CONTEXT
   +0x350 PktMonEdgeLower  : _PKTMON_EDGE_CONTEXT
   +0x378 PktMonEdgeUpper  : _PKTMON_EDGE_CONTEXT
   +0x3a0 NblContextVerifierContext : _NBL_CONTEXT_VERIFIER_CONTEXT
   +0x3c0 SriovHwCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3cc SriovCurrentCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3d8 NicSwitchHwCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x45c NicSwitchCurrentCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x4e0 ReceiveFilterHwCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x534 ReceiveFilterCurrentCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x000 Header           : _NDIS_OBJECT_HEADER
   +0x008 NextFilter       : (null) 
   +0x010 FilterDriver     : 0xffffd306`36064cf0 _NDIS_FILTER_DRIVER_BLOCK
   +0x018 FilterModuleContext : 0xffffd306`37223aa0 Void
   +0x020 Miniport         : 0xffffd306`363851a0 _NDIS_MINIPORT_BLOCK
   +0x028 FilterInstanceName : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x030 FilterFriendlyName : 0xffffd306`37161040 _UNICODE_STRING "Microsoft Hyper-V Network Adapter #2-WFP 802.3 MAC Layer LightWeight Filter-0000"
   +0x038 Flags            : 0x10
   +0x03c StackFlags       : 0
   +0x040 State            : 4 ( NdisFilterRunning )
   +0x048 Ref              : _REFERENCE_EX
   +0x060 FakeStatus       : 0n0
   +0x068 NextGlobalFilter : 0xffffd306`37226010 _NDIS_FILTER_BLOCK
   +0x070 LowerFilter      : 0xffffd306`37226010 _NDIS_FILTER_BLOCK
   +0x078 HigherFilter     : (null) 
   +0x080 AsyncOpContext   : (null) 
   +0x088 NumOfPauseRestartRequests : 0n0
   +0x090 Lock             : 0
   +0x098 LockThread       : (null) 
   +0x0a0 OidRequestList   : _LIST_ENTRY [ 0xffffd306`37227aa0 - 0xffffd306`37227aa0 ]
   +0x0b0 PendingOidRequest : (null) 
   +0x0b8 PendingOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x0c0 StackExpansionFallback : _NDIS_FILTER_BLOCK::<unnamed-type-StackExpansionFallback>
   +0x120 StatusIndicationsQueued : 0 ''
   +0x124 DroppedReceiveNbls : 0n0
   +0x128 DroppedSendNbls  : 0n0
   +0x12c DroppedStatusIndications : 0
   +0x130 DroppedUncloneableStatusIndications : 0
   +0x138 PnPRef           : _REFERENCE_EX
   +0x150 MediaType        : 0 ( NdisMedium802_3 )
   +0x154 PhysicalMediaType : 0 ( NdisPhysicalMediumUnspecified )
   +0x158 MediaConnectState : 1 ( MediaConnectStateConnected )
   +0x15c MediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x160 XmitLinkSpeed    : 0x00000002`540be400
   +0x168 RcvLinkSpeed     : 0x00000002`540be400
   +0x170 PauseFunctions   : 0 ( NdisPauseFunctionsUnsupported )
   +0x174 AutoNegotiationFlags : 0
   +0x178 XState           : 0 ''
   +0x179 Reserved1        : 0 ''
   +0x17a Reserved2        : 0 ''
   +0x17b Reserved3        : 0 ''
   +0x17c MediaConnectStateIndicateUp : 1 ( MediaConnectStateConnected )
   +0x180 MediaDuplexStateIndicateUp : 0 ( MediaDuplexStateUnknown )
   +0x188 XmitLinkSpeedIndicateUp : 0x00000002`540be400
   +0x190 RcvLinkSpeedIndicateUp : 0x00000002`540be400
   +0x198 PauseFunctionsIndicateUp : 0 ( NdisPauseFunctionsUnsupported )
   +0x19c AutoNegotiationFlagsIndicateUp : 0
   +0x1a0 NextRequestHandle : 0xffffd306`37226010 Void
   +0x1a8 IterativeDataPathTracker : (null) 
   +0x1b0 NextSendNetBufferListsHandler : 0xfffff805`36e97ce0     void  +fffff80536e97ce0
   +0x1b8 NextSendNetBufferListsContext : 0xffffd306`37224af0 Void
   +0x1c0 NextSendNetBufferListsTracker : 0xffffd306`361c6591 NDIS_NBL_TRACKER_HANDLE__
   +0x1c8 NextSendNetBufferListsObject : 0xffffd306`37224520 _NDIS_OBJECT_HEADER
   +0x1d0 NextSendNetBufferListsCompleteHandler : 0xfffff805`36105080     void  NDIS!ndisMSendCompleteNetBufferListsInternal+0
   +0x1d8 NextSendNetBufferListsCompleteContext : 0xffffd306`363851a0 Void
   +0x1e0 NextSendNetBufferListsCompleteTracker : 0x00000000`00000030 NDIS_NBL_TRACKER_HANDLE__
   +0x1e8 NextSendNetBufferListsCompleteObject : 0xffffd306`363851a0 _NDIS_OBJECT_HEADER
   +0x1f0 NextIndicateReceiveNetBufferListsHandler : 0xfffff805`360dd460     void  NDIS!ndisMTopReceiveNetBufferLists+0
   +0x1f8 NextIndicateReceiveNetBufferListsContext : 0xffffd306`363851a0 Void
   +0x200 NextIndicateReceiveNetBufferListsTracker : 0x00000000`00000020 NDIS_NBL_TRACKER_HANDLE__
   +0x208 NextIndicateReceiveNetBufferListsObject : 0xffffd306`363851a0 _NDIS_OBJECT_HEADER
   +0x210 NextReturnNetBufferListsHandler : 0xfffff805`36e917d0     void  +fffff80536e917d0
   +0x218 NextReturnNetBufferListsContext : 0xffffd306`37224af0 Void
   +0x220 NextReturnNetBufferListsTracker : 0xffffd306`361c6591 NDIS_NBL_TRACKER_HANDLE__
   +0x228 NextReturnNetBufferListsObject : 0xffffd306`37224520 _NDIS_OBJECT_HEADER
   +0x230 NextCancelSendNetBufferListsHandler : 0xfffff805`3618b540     void  NDIS!ndisMCancelSendNetBufferListsOnMiniport+0
   +0x238 NextCancelSendNetBufferListsContext : 0xffffd306`363851a0 Void
   +0x240 Characteristics  : _NDIS_FILTER_PARTIAL_CHARACTERISTICS
   +0x270 FilterSendNetBufferListsHandler : 0xfffff805`360d8f70     void  NDIS!ndisFilterSendNetBufferLists+0
   +0x278 FilterIndicateReceiveNetBufferListsHandler : 0xfffff805`360e0df0     void  NDIS!ndisFilterIndicateReceiveNetBufferLists+0
   +0x280 FilterCancelSendNetBufferListsHandler : 0xfffff805`3615a9f0     void  NDIS!ndisFilterCancelSendNetBufferLists+0
   +0x288 NblTracker       : 0xffffd306`361c62f1 NDIS_NBL_TRACKER_HANDLE__
   +0x290 Offload          : 0xffffd306`36820140 _NDIS_FILTER_TASK_OFFLOAD
   +0x298 InterfaceGuid    : _GUID {a8de4565-3855-11f0-a4c5-806e6f6e6963}
   +0x2a8 IfIndex          : 0x13
   +0x2b0 IfBlock          : 0xffffd306`372265e0 _NDIS_IF_BLOCK
   +0x2b8 NextDirectRequestHandle : 0xffffd306`363851a0 Void
   +0x2c0 DirectOidRequestCount : 0
   +0x2c8 WOLPatternList   : _SINGLE_LIST_ENTRY
   +0x2d0 PMProtocolOffloadList : _SINGLE_LIST_ENTRY
   +0x2d8 PMCurrentParameters : _NDIS_PM_PARAMETERS
   +0x2f0 Bind             : 0xffff8586`6396d150 NDIS_BIND_FILTER_LINK
   +0x2f8 HwTimestampCapabilities : (null) 
   +0x300 HwTimestampCurrentConfig : (null) 
   +0x308 VerifierContext  : (null) 
   +0x310 PktMonComp       : _PKTMON_COMPONENT_CONTEXT
   +0x350 PktMonEdgeLower  : _PKTMON_EDGE_CONTEXT
   +0x378 PktMonEdgeUpper  : _PKTMON_EDGE_CONTEXT
   +0x3a0 NblContextVerifierContext : _NBL_CONTEXT_VERIFIER_CONTEXT
   +0x3c0 SriovHwCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3cc SriovCurrentCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3d8 NicSwitchHwCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x45c NicSwitchCurrentCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x4e0 ReceiveFilterHwCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x534 ReceiveFilterCurrentCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x000 Header           : _NDIS_OBJECT_HEADER
   +0x008 NextFilter       : (null) 
   +0x010 FilterDriver     : 0xffffd306`363ddde0 _NDIS_FILTER_DRIVER_BLOCK
   +0x018 FilterModuleContext : 0xffffd306`361c3230 Void
   +0x020 Miniport         : 0xffffd306`363851a0 _NDIS_MINIPORT_BLOCK
   +0x028 FilterInstanceName : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x030 FilterFriendlyName : 0xffffd306`36cffa00 _UNICODE_STRING "Microsoft Hyper-V Network Adapter #2-QoS Packet Scheduler-0000"
   +0x038 Flags            : 0x10
   +0x03c StackFlags       : 1
   +0x040 State            : 4 ( NdisFilterRunning )
   +0x048 Ref              : _REFERENCE_EX
   +0x060 FakeStatus       : 0n0
   +0x068 NextGlobalFilter : 0xffffd306`37224520 _NDIS_FILTER_BLOCK
   +0x070 LowerFilter      : 0xffffd306`37224520 _NDIS_FILTER_BLOCK
   +0x078 HigherFilter     : 0xffffd306`37227a00 _NDIS_FILTER_BLOCK
   +0x080 AsyncOpContext   : (null) 
   +0x088 NumOfPauseRestartRequests : 0n0
   +0x090 Lock             : 0
   +0x098 LockThread       : (null) 
   +0x0a0 OidRequestList   : _LIST_ENTRY [ 0xffffd306`372260b0 - 0xffffd306`372260b0 ]
   +0x0b0 PendingOidRequest : (null) 
   +0x0b8 PendingOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x0c0 StackExpansionFallback : _NDIS_FILTER_BLOCK::<unnamed-type-StackExpansionFallback>
   +0x120 StatusIndicationsQueued : 0 ''
   +0x124 DroppedReceiveNbls : 0n0
   +0x128 DroppedSendNbls  : 0n0
   +0x12c DroppedStatusIndications : 0
   +0x130 DroppedUncloneableStatusIndications : 0
   +0x138 PnPRef           : _REFERENCE_EX
   +0x150 MediaType        : 0 ( NdisMedium802_3 )
   +0x154 PhysicalMediaType : 0 ( NdisPhysicalMediumUnspecified )
   +0x158 MediaConnectState : 1 ( MediaConnectStateConnected )
   +0x15c MediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x160 XmitLinkSpeed    : 0x00000002`540be400
   +0x168 RcvLinkSpeed     : 0x00000002`540be400
   +0x170 PauseFunctions   : 0 ( NdisPauseFunctionsUnsupported )
   +0x174 AutoNegotiationFlags : 0
   +0x178 XState           : 0 ''
   +0x179 Reserved1        : 0 ''
   +0x17a Reserved2        : 0 ''
   +0x17b Reserved3        : 0 ''
   +0x17c MediaConnectStateIndicateUp : 1 ( MediaConnectStateConnected )
   +0x180 MediaDuplexStateIndicateUp : 0 ( MediaDuplexStateUnknown )
   +0x188 XmitLinkSpeedIndicateUp : 0x00000002`540be400
   +0x190 RcvLinkSpeedIndicateUp : 0x00000002`540be400
   +0x198 PauseFunctionsIndicateUp : 0 ( NdisPauseFunctionsUnsupported )
   +0x19c AutoNegotiationFlagsIndicateUp : 0
   +0x1a0 NextRequestHandle : 0xffffd306`37224520 Void
   +0x1a8 IterativeDataPathTracker : (null) 
   +0x1b0 NextSendNetBufferListsHandler : 0xfffff805`36e97ce0     void  +fffff80536e97ce0
   +0x1b8 NextSendNetBufferListsContext : 0xffffd306`37224af0 Void
   +0x1c0 NextSendNetBufferListsTracker : 0xffffd306`361c6591 NDIS_NBL_TRACKER_HANDLE__
   +0x1c8 NextSendNetBufferListsObject : 0xffffd306`37224520 _NDIS_OBJECT_HEADER
   +0x1d0 NextSendNetBufferListsCompleteHandler : 0xfffff805`36105080     void  NDIS!ndisMSendCompleteNetBufferListsInternal+0
   +0x1d8 NextSendNetBufferListsCompleteContext : 0xffffd306`363851a0 Void
   +0x1e0 NextSendNetBufferListsCompleteTracker : 0x00000000`00000030 NDIS_NBL_TRACKER_HANDLE__
   +0x1e8 NextSendNetBufferListsCompleteObject : 0xffffd306`363851a0 _NDIS_OBJECT_HEADER
   +0x1f0 NextIndicateReceiveNetBufferListsHandler : 0xfffff805`360dd460     void  NDIS!ndisMTopReceiveNetBufferLists+0
   +0x1f8 NextIndicateReceiveNetBufferListsContext : 0xffffd306`363851a0 Void
   +0x200 NextIndicateReceiveNetBufferListsTracker : 0x00000000`00000020 NDIS_NBL_TRACKER_HANDLE__
   +0x208 NextIndicateReceiveNetBufferListsObject : 0xffffd306`363851a0 _NDIS_OBJECT_HEADER
   +0x210 NextReturnNetBufferListsHandler : 0xfffff805`36e917d0     void  +fffff80536e917d0
   +0x218 NextReturnNetBufferListsContext : 0xffffd306`37224af0 Void
   +0x220 NextReturnNetBufferListsTracker : 0xffffd306`361c6591 NDIS_NBL_TRACKER_HANDLE__
   +0x228 NextReturnNetBufferListsObject : 0xffffd306`37224520 _NDIS_OBJECT_HEADER
   +0x230 NextCancelSendNetBufferListsHandler : 0xfffff805`3618b540     void  NDIS!ndisMCancelSendNetBufferListsOnMiniport+0
   +0x238 NextCancelSendNetBufferListsContext : 0xffffd306`363851a0 Void
   +0x240 Characteristics  : _NDIS_FILTER_PARTIAL_CHARACTERISTICS
   +0x270 FilterSendNetBufferListsHandler : 0xfffff805`360d8f70     void  NDIS!ndisFilterSendNetBufferLists+0
   +0x278 FilterIndicateReceiveNetBufferListsHandler : 0xfffff805`360e0df0     void  NDIS!ndisFilterIndicateReceiveNetBufferLists+0
   +0x280 FilterCancelSendNetBufferListsHandler : 0xfffff805`3615a9f0     void  NDIS!ndisFilterCancelSendNetBufferLists+0
   +0x288 NblTracker       : 0xffffd306`361c6771 NDIS_NBL_TRACKER_HANDLE__
   +0x290 Offload          : 0xffffd306`368218b0 _NDIS_FILTER_TASK_OFFLOAD
   +0x298 InterfaceGuid    : _GUID {a8de4564-3855-11f0-a4c5-806e6f6e6963}
   +0x2a8 IfIndex          : 0x12
   +0x2b0 IfBlock          : 0xffffd306`37227010 _NDIS_IF_BLOCK
   +0x2b8 NextDirectRequestHandle : 0xffffd306`363851a0 Void
   +0x2c0 DirectOidRequestCount : 0
   +0x2c8 WOLPatternList   : _SINGLE_LIST_ENTRY
   +0x2d0 PMProtocolOffloadList : _SINGLE_LIST_ENTRY
   +0x2d8 PMCurrentParameters : _NDIS_PM_PARAMETERS
   +0x2f0 Bind             : 0xffff8586`6396d850 NDIS_BIND_FILTER_LINK
   +0x2f8 HwTimestampCapabilities : (null) 
   +0x300 HwTimestampCurrentConfig : (null) 
   +0x308 VerifierContext  : (null) 
   +0x310 PktMonComp       : _PKTMON_COMPONENT_CONTEXT
   +0x350 PktMonEdgeLower  : _PKTMON_EDGE_CONTEXT
   +0x378 PktMonEdgeUpper  : _PKTMON_EDGE_CONTEXT
   +0x3a0 NblContextVerifierContext : _NBL_CONTEXT_VERIFIER_CONTEXT
   +0x3c0 SriovHwCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3cc SriovCurrentCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3d8 NicSwitchHwCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x45c NicSwitchCurrentCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x4e0 ReceiveFilterHwCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x534 ReceiveFilterCurrentCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x000 Header           : _NDIS_OBJECT_HEADER
   +0x008 NextFilter       : (null) 
   +0x010 FilterDriver     : 0xffffd306`36063c80 _NDIS_FILTER_DRIVER_BLOCK
   +0x018 FilterModuleContext : 0xffffd306`37224af0 Void
   +0x020 Miniport         : 0xffffd306`363851a0 _NDIS_MINIPORT_BLOCK
   +0x028 FilterInstanceName : wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
   +0x030 FilterFriendlyName : 0xffffd306`371623c0 _UNICODE_STRING "Microsoft Hyper-V Network Adapter #2-WFP Native MAC Layer LightWeight Filter-0000"
   +0x038 Flags            : 0x10
   +0x03c StackFlags       : 0
   +0x040 State            : 4 ( NdisFilterRunning )
   +0x048 Ref              : _REFERENCE_EX
   +0x060 FakeStatus       : 0n0
   +0x068 NextGlobalFilter : (null) 
   +0x070 LowerFilter      : (null) 
   +0x078 HigherFilter     : 0xffffd306`37226010 _NDIS_FILTER_BLOCK
   +0x080 AsyncOpContext   : (null) 
   +0x088 NumOfPauseRestartRequests : 0n0
   +0x090 Lock             : 0
   +0x098 LockThread       : (null) 
   +0x0a0 OidRequestList   : _LIST_ENTRY [ 0xffffd306`372245c0 - 0xffffd306`372245c0 ]
   +0x0b0 PendingOidRequest : (null) 
   +0x0b8 PendingOidWatchdog : wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__cdecl*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned __int64,1>,NDISWATCHDOG__ *,__int64,-1,std::nullptr_t> > >
   +0x0c0 StackExpansionFallback : _NDIS_FILTER_BLOCK::<unnamed-type-StackExpansionFallback>
   +0x120 StatusIndicationsQueued : 0 ''
   +0x124 DroppedReceiveNbls : 0n0
   +0x128 DroppedSendNbls  : 0n0
   +0x12c DroppedStatusIndications : 0
   +0x130 DroppedUncloneableStatusIndications : 0
   +0x138 PnPRef           : _REFERENCE_EX
   +0x150 MediaType        : 0 ( NdisMedium802_3 )
   +0x154 PhysicalMediaType : 0 ( NdisPhysicalMediumUnspecified )
   +0x158 MediaConnectState : 1 ( MediaConnectStateConnected )
   +0x15c MediaDuplexState : 0 ( MediaDuplexStateUnknown )
   +0x160 XmitLinkSpeed    : 0x00000002`540be400
   +0x168 RcvLinkSpeed     : 0x00000002`540be400
   +0x170 PauseFunctions   : 0 ( NdisPauseFunctionsUnsupported )
   +0x174 AutoNegotiationFlags : 0
   +0x178 XState           : 0 ''
   +0x179 Reserved1        : 0 ''
   +0x17a Reserved2        : 0 ''
   +0x17b Reserved3        : 0 ''
   +0x17c MediaConnectStateIndicateUp : 1 ( MediaConnectStateConnected )
   +0x180 MediaDuplexStateIndicateUp : 0 ( MediaDuplexStateUnknown )
   +0x188 XmitLinkSpeedIndicateUp : 0x00000002`540be400
   +0x190 RcvLinkSpeedIndicateUp : 0x00000002`540be400
   +0x198 PauseFunctionsIndicateUp : 0 ( NdisPauseFunctionsUnsupported )
   +0x19c AutoNegotiationFlagsIndicateUp : 0
   +0x1a0 NextRequestHandle : 0xffffd306`363851a0 Void
   +0x1a8 IterativeDataPathTracker : 0xffffd306`3685f180 [4] _NDIS_ITERATIVE_DATA_PATH_TRACKER_ENTRY
   +0x1b0 NextSendNetBufferListsHandler : 0xfffff805`360f5370     void  NDIS!ndisMSendNBLToMiniport+0
   +0x1b8 NextSendNetBufferListsContext : 0xffffd306`363851a0 Void
   +0x1c0 NextSendNetBufferListsTracker : 0xffffd306`361c45b1 NDIS_NBL_TRACKER_HANDLE__
   +0x1c8 NextSendNetBufferListsObject : 0xffffd306`363851a0 _NDIS_OBJECT_HEADER
   +0x1d0 NextSendNetBufferListsCompleteHandler : 0xfffff805`36105080     void  NDIS!ndisMSendCompleteNetBufferListsInternal+0
   +0x1d8 NextSendNetBufferListsCompleteContext : 0xffffd306`363851a0 Void
   +0x1e0 NextSendNetBufferListsCompleteTracker : 0x00000000`00000030 NDIS_NBL_TRACKER_HANDLE__
   +0x1e8 NextSendNetBufferListsCompleteObject : 0xffffd306`363851a0 _NDIS_OBJECT_HEADER
   +0x1f0 NextIndicateReceiveNetBufferListsHandler : 0xfffff805`360dd460     void  NDIS!ndisMTopReceiveNetBufferLists+0
   +0x1f8 NextIndicateReceiveNetBufferListsContext : 0xffffd306`363851a0 Void
   +0x200 NextIndicateReceiveNetBufferListsTracker : 0x00000000`00000020 NDIS_NBL_TRACKER_HANDLE__
   +0x208 NextIndicateReceiveNetBufferListsObject : 0xffffd306`363851a0 _NDIS_OBJECT_HEADER
   +0x210 NextReturnNetBufferListsHandler : 0xfffff805`37d95a10     void  +fffff80537d95a10
   +0x218 NextReturnNetBufferListsContext : 0xffffd306`36876010 Void
   +0x220 NextReturnNetBufferListsTracker : 0xffffd306`361c45b1 NDIS_NBL_TRACKER_HANDLE__
   +0x228 NextReturnNetBufferListsObject : 0xffffd306`363851a0 _NDIS_OBJECT_HEADER
   +0x230 NextCancelSendNetBufferListsHandler : 0xfffff805`3618b540     void  NDIS!ndisMCancelSendNetBufferListsOnMiniport+0
   +0x238 NextCancelSendNetBufferListsContext : 0xffffd306`363851a0 Void
   +0x240 Characteristics  : _NDIS_FILTER_PARTIAL_CHARACTERISTICS
   +0x270 FilterSendNetBufferListsHandler : 0xfffff805`360d8f70     void  NDIS!ndisFilterSendNetBufferLists+0
   +0x278 FilterIndicateReceiveNetBufferListsHandler : 0xfffff805`360e0df0     void  NDIS!ndisFilterIndicateReceiveNetBufferLists+0
   +0x280 FilterCancelSendNetBufferListsHandler : 0xfffff805`3615a9f0     void  NDIS!ndisFilterCancelSendNetBufferLists+0
   +0x288 NblTracker       : 0xffffd306`361c6591 NDIS_NBL_TRACKER_HANDLE__
   +0x290 Offload          : 0xffffd306`3681e520 _NDIS_FILTER_TASK_OFFLOAD
   +0x298 InterfaceGuid    : _GUID {a8de4563-3855-11f0-a4c5-806e6f6e6963}
   +0x2a8 IfIndex          : 0x11
   +0x2b0 IfBlock          : 0xffffd306`37225760 _NDIS_IF_BLOCK
   +0x2b8 NextDirectRequestHandle : 0xffffd306`363851a0 Void
   +0x2c0 DirectOidRequestCount : 0
   +0x2c8 WOLPatternList   : _SINGLE_LIST_ENTRY
   +0x2d0 PMProtocolOffloadList : _SINGLE_LIST_ENTRY
   +0x2d8 PMCurrentParameters : _NDIS_PM_PARAMETERS
   +0x2f0 Bind             : 0xffff8586`6396d070 NDIS_BIND_FILTER_LINK
   +0x2f8 HwTimestampCapabilities : (null) 
   +0x300 HwTimestampCurrentConfig : (null) 
   +0x308 VerifierContext  : (null) 
   +0x310 PktMonComp       : _PKTMON_COMPONENT_CONTEXT
   +0x350 PktMonEdgeLower  : _PKTMON_EDGE_CONTEXT
   +0x378 PktMonEdgeUpper  : _PKTMON_EDGE_CONTEXT
   +0x3a0 NblContextVerifierContext : _NBL_CONTEXT_VERIFIER_CONTEXT
   +0x3c0 SriovHwCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3cc SriovCurrentCapabilities : _NDIS_SRIOV_CAPABILITIES
   +0x3d8 NicSwitchHwCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x45c NicSwitchCurrentCapabilities : _NDIS_NIC_SWITCH_CAPABILITIES
   +0x4e0 ReceiveFilterHwCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
   +0x534 ReceiveFilterCurrentCapabilities : _NDIS_RECEIVE_FILTER_CAPABILITIES
